[
  {
    "segment_id": 1,
    "speaker_group": 1,
    "source_text": "So I'm Nora Herold. I know a lot of you are familiar with my work. For those of you who are meeting me for the first time, I've been channeling consciously for about 20 years."
  },
  {
    "segment_id": 2,
    "speaker_group": 1,
    "source_text": "Um, but for all of my life, I was hearing things and feeling things and seeing things and knowing things and I didn't have a context for it."
  },
  {
    "segment_id": 3,
    "speaker_group": 1,
    "source_text": "I didn't understand it."
  },
  {
    "segment_id": 4,
    "speaker_group": 1,
    "source_text": "Oftentimes it felt distracting and overwhelming."
  },
  {
    "segment_id": 5,
    "speaker_group": 1,
    "source_text": "I didn't really understand that it could be an experience that would support or contribute to my reality."
  },
  {
    "segment_id": 6,
    "speaker_group": 1,
    "source_text": "And then in 1996 I found myself in a ball on the floor."
  },
  {
    "segment_id": 7,
    "speaker_group": 1,
    "source_text": "At the age of 29 years old, going through my Saturn return, my first Saturn return."
  },
  {
    "segment_id": 8,
    "speaker_group": 1,
    "source_text": "And I was depressed and had gone through a very dramatic breakup and felt brokenhearted."
  },
  {
    "segment_id": 9,
    "speaker_group": 1,
    "source_text": "And you know the beautiful thing about heartbreak is it opens us all up."
  },
  {
    "segment_id": 10,
    "speaker_group": 1,
    "source_text": "And in that very open space I was hanging out with a dear friend one night who read tarot cards as I also read tarot cards."
  },
  {
    "segment_id": 11,
    "speaker_group": 1,
    "source_text": "I'd read tarot cards for years. I'd played with crystals. You know, I'd started to tune in consciously at about the age of 20."
  },
  {
    "segment_id": 12,
    "speaker_group": 1,
    "source_text": "She mentions that she had met a woman recently who channeled her spirit guides."
  },
  {
    "segment_id": 13,
    "speaker_group": 1,
    "source_text": "And that woman was Wendy Kennedy. So this is back in Chicago back in 1996. And I said oh I think that's what I'm looking for. And why don't we try? And she said great, I've been trying and she'd had some luck, feeling something. But when the two of us sat down together that night with the intention to connect it happened almost immediately."
  },
  {
    "segment_id": 14,
    "speaker_group": 1,
    "source_text": "I felt the presence of a being that was so loving, so calming, and so nurturing to me. It was unlike anything I had ever experienced as Nora before."
  },
  {
    "segment_id": 15,
    "speaker_group": 1,
    "source_text": "And it was very quick moment. I felt his love. I felt his energy as male and I knew his name started with an M."
  },
  {
    "segment_id": 16,
    "speaker_group": 1,
    "source_text": "And then the tube on Amy's television blew out."
  },
  {
    "segment_id": 17,
    "speaker_group": 1,
    "source_text": "As Amy was also having her own connection experience. And then very shortly afterwards, she and I got together with Wendy, and that was my first meeting with Wendy Kennedy. And Wendy, Amy, and I channeled together for play, for fun, for quite some time. That was how we spent our evenings was hanging out channeling for each other, channeling for our friends, you know, we didn't go to bars and get drunk. We stayed in my apartment, my little basement apartment in Chicago and ate cookies and channeled."
  },
  {
    "segment_id": 18,
    "speaker_group": 1,
    "source_text": "And then at some point it became clear that this was the service work that I was here to do."
  },
  {
    "segment_id": 19,
    "speaker_group": 1,
    "source_text": "So it is now what I do. It's what I've done for a very long time and my work has evolved over the years. I channel many different beings. The Pleiadian Collective is primary right now in my channeling work and then Yeshua and Calliandra are close behind, and then behind them the Lyrans and the archangels and all the other beings. And so many beings participate when we channel, you know, it's funny, you know listening to Shelley bring through Gabriel and I could feel all the other energies braiding in"
  },
  {
    "segment_id": 20,
    "speaker_group": 1,
    "source_text": "and working through her as well."
  },
  {
    "segment_id": 21,
    "speaker_group": 1,
    "source_text": "It's true for everyone I listened to yesterday, so the same will happen today. What I recommend for all of you is that you really... allow yourselves to recognize your own experience of channeling while I'm channeling today."
  },
  {
    "segment_id": 22,
    "speaker_group": 1,
    "source_text": "Because to be able to receive channeled information in any format means that your channeling."
  },
  {
    "segment_id": 23,
    "speaker_group": 1,
    "source_text": "Doesn't matter that's coming out of my mouth."
  },
  {
    "segment_id": 24,
    "speaker_group": 1,
    "source_text": "You're acting as the receivers for the information as well. Okay, I'm going to sit down now."
  },
  {
    "segment_id": 25,
    "speaker_group": 1,
    "source_text": "I'm gonna straighten myself out here. How's my hair? Okay. Now now Nora will quiet down. I'll tell you that when I channel. I'm very present."
  },
  {
    "segment_id": 26,
    "speaker_group": 1,
    "source_text": "So you may hear from me again during the channeling portion. Okay?"
  },
  {
    "segment_id": 27,
    "speaker_group": 1,
    "source_text": "(Oming sounds) Ahhhhh....."
  },
  {
    "segment_id": 28,
    "speaker_group": 1,
    "source_text": "Fantastic!"
  },
  {
    "segment_id": 29,
    "speaker_group": 1,
    "source_text": "Greetings, this is the Pleiadian Collective and as always it is so wonderful to connect with all of you beautiful universal beings of light and love, look at you all."
  },
  {
    "segment_id": 30,
    "speaker_group": 1,
    "source_text": "Look at your beauty!"
  },
  {
    "segment_id": 31,
    "speaker_group": 1,
    "source_text": "Look at your light!"
  },
  {
    "segment_id": 32,
    "speaker_group": 1,
    "source_text": "Look at the beauty in the projection of your light bodies into your physical reality, see yourselves right now as the beautiful beings you are."
  },
  {
    "segment_id": 33,
    "speaker_group": 1,
    "source_text": "Both beings of light, beings holding physical density. Feel your bodies, put your hands on your body."
  },
  {
    "segment_id": 34,
    "speaker_group": 1,
    "source_text": "Yeah."
  },
  {
    "segment_id": 35,
    "speaker_group": 1,
    "source_text": "Put your hands somewhere that particularly you don't like."
  },
  {
    "segment_id": 36,
    "speaker_group": 1,
    "source_text": "Alright, find a find a place on your body that you perhaps might not think is so beautiful. Alright, and just breathe."
  },
  {
    "segment_id": 37,
    "speaker_group": 1,
    "source_text": "And connect."
  },
  {
    "segment_id": 38,
    "speaker_group": 1,
    "source_text": "This is your light!"
  },
  {
    "segment_id": 39,
    "speaker_group": 1,
    "source_text": "What you're touching right now is you, your light."
  },
  {
    "segment_id": 40,
    "speaker_group": 1,
    "source_text": "You are love incarnate."
  },
  {
    "segment_id": 41,
    "speaker_group": 1,
    "source_text": "You are nothing else."
  },
  {
    "segment_id": 42,
    "speaker_group": 1,
    "source_text": "All around you is love incarnate, nothing else."
  },
  {
    "segment_id": 43,
    "speaker_group": 1,
    "source_text": "Doesn't matter what it looks like, feels like, the costume it's wearing."
  },
  {
    "segment_id": 44,
    "speaker_group": 1,
    "source_text": "Love incarnate, the table, the chair, the ceiling, the walls, the air, the atmosphere, the Republican, the Democrat, the Illuminati."
  },
  {
    "segment_id": 45,
    "speaker_group": 1,
    "source_text": "Yeshua, us, you, love incarnate."
  },
  {
    "segment_id": 46,
    "speaker_group": 1,
    "source_text": "Love playing a game. That's all this is."
  },
  {
    "segment_id": 47,
    "speaker_group": 1,
    "source_text": "And that's all there is to the idea of awakening from within."
  },
  {
    "segment_id": 48,
    "speaker_group": 1,
    "source_text": "And as we look at all of you, what we see: all of you here in this room, all of you listening in, all of you tuning in at a later date, is you're already awake."
  },
  {
    "segment_id": 49,
    "speaker_group": 1,
    "source_text": "Right?  Who in the room feels awake?"
  },
  {
    "segment_id": 50,
    "speaker_group": 1,
    "source_text": "Yes."
  },
  {
    "segment_id": 51,
    "speaker_group": 1,
    "source_text": "And yet you continue to awaken."
  },
  {
    "segment_id": 52,
    "speaker_group": 1,
    "source_text": "Because this is the game."
  },
  {
    "segment_id": 53,
    "speaker_group": 1,
    "source_text": "You wake up, you remember right? You all remember that? Yes, remember when you woke up? Everyone here had some sort of an awakening moment. It may have been very small. It may have been gigantic. It really doesn't matter, every single one of you at some point came in awake, went back to sleep, because that's what happened, for all of you. Most of the children coming in now, they don't have to go through this, you know."
  },
  {
    "segment_id": 54,
    "speaker_group": 1,
    "source_text": "They're not going back to sleep as you all did."
  },
  {
    "segment_id": 55,
    "speaker_group": 1,
    "source_text": "Sometimes they take little naps, alright?"
  },
  {
    "segment_id": 56,
    "speaker_group": 1,
    "source_text": "They forget for a bit of time who they are and then it's very easy for them to wake themselves up and remember. But you all, you came into an incredibly dense environment awake and then went back to sleep because that was the game plan. That's the program. You weren't supposed to remember throughout the totality of this incarnation that you are love incarnate."
  },
  {
    "segment_id": 57,
    "speaker_group": 1,
    "source_text": "You were supposed to come in, forget that, throw on a costume, create a whole bunch of drama for yourselves, work through a myriad of issues, traumas, most of which have nothing to do with this incarnation."
  },
  {
    "segment_id": 58,
    "speaker_group": 1,
    "source_text": "Alright so think about that piece right now. Anytime you've given yourself something to work on in this lifetime, what you've also been doing and the main reason you gave yourselves those things to work on, is you've been clearing up with yourselves all of these unhealed traumas from all of these other lifetimes, that didn't happen in the past, that are happening right now, because all is now, right?"
  },
  {
    "segment_id": 59,
    "speaker_group": 1,
    "source_text": "Every version of you that you see is a past life version of you, is truly existing right now in a moment in time, currently experiencing whatever pain, whatever loss, whatever grief, whatever anger, whatever hurt, whatever anguish, etc. And throughout this incarnation you have picked up again and again and again and again these pieces of your oversoul that are sitting in distress. You have interacted with them,"
  },
  {
    "segment_id": 60,
    "speaker_group": 1,
    "source_text": "sent them transmissions of unconditional love as you have worked on your own stuff."
  },
  {
    "segment_id": 61,
    "speaker_group": 1,
    "source_text": "And suddenly you find yourself then to be a much more powerful, clear, and sovereign being."
  },
  {
    "segment_id": 62,
    "speaker_group": 1,
    "source_text": "Ever wonder if there's intelligent life elsewhere in the universe?"
  },
  {
    "segment_id": 63,
    "speaker_group": 1,
    "source_text": "Well, I have....I've been wondering since I was a kid."
  },
  {
    "segment_id": 64,
    "speaker_group": 1,
    "source_text": "My name is Reuben Langdon."
  },
  {
    "segment_id": 65,
    "speaker_group": 1,
    "source_text": "And on March 29th, 2007, in the middle of the day, I saw a number of strange objects in the sky."
  },
  {
    "segment_id": 66,
    "speaker_group": 1,
    "source_text": "Coincidentally, I was working on the film Avatar at the time, playing an alien."
  },
  {
    "segment_id": 67,
    "speaker_group": 1,
    "source_text": "And ever since then I've been on a quest..."
  },
  {
    "segment_id": 68,
    "speaker_group": 1,
    "source_text": "A quest to find out if aliens really do exist and if so... ...are they here with us?"
  },
  {
    "segment_id": 69,
    "speaker_group": 1,
    "source_text": "If beings of higher intelligence are here... ...what is their purpose?"
  },
  {
    "segment_id": 70,
    "speaker_group": 1,
    "source_text": "Why don't they make themselves more known?"
  },
  {
    "segment_id": 71,
    "speaker_group": 1,
    "source_text": "Why the secrecy?"
  },
  {
    "segment_id": 72,
    "speaker_group": 1,
    "source_text": "I've asked these questions to many experts, yet, each seems to have a different theory."
  },
  {
    "segment_id": 73,
    "speaker_group": 1,
    "source_text": "So I thought to myself, why not ask the aliens directly?"
  },
  {
    "segment_id": 74,
    "speaker_group": 1,
    "source_text": "So that's what I set out to do!"
  },
  {
    "segment_id": 75,
    "speaker_group": 1,
    "source_text": "Well, sort of..."
  },
  {
    "segment_id": 76,
    "speaker_group": 1,
    "source_text": "Nora."
  },
  {
    "segment_id": 77,
    "speaker_group": 1,
    "source_text": "Reuben."
  },
  {
    "segment_id": 78,
    "speaker_group": 1,
    "source_text": "Here we are, thank you for doing this second time, sort of.  We've been filming you on and off here."
  },
  {
    "segment_id": 79,
    "speaker_group": 1,
    "source_text": "Um."
  },
  {
    "segment_id": 80,
    "speaker_group": 1,
    "source_text": "Can you describe to me the process of what do you do and what kind of energies do you tap into and then hopefully we can tap into them today?"
  },
  {
    "segment_id": 81,
    "speaker_group": 1,
    "source_text": "Sure. So I do what's called direct voice channeling."
  },
  {
    "segment_id": 82,
    "speaker_group": 1,
    "source_text": "I also translate, so there are two different versions of channeling work."
  },
  {
    "segment_id": 83,
    "speaker_group": 1,
    "source_text": "Translation is, I listen and receive and then tell you in my own voice the information I'm getting and what I hear and often do that when I work privately in one-on-one sessions I'll do some translation work and I'll use my own voice and they've expressed the importance of us, all of us, accessing information in a variety of ways."
  },
  {
    "segment_id": 84,
    "speaker_group": 1,
    "source_text": "So that's one of the ways I access information, but then I also direct voice channel."
  },
  {
    "segment_id": 85,
    "speaker_group": 1,
    "source_text": "So direct voice channel means I raise my personal vibration to a point where I can connect up with beings who exist in a higher dimension, another vibration, another frequency. They interact with me telepathically, move through me energetically, I allow them to alter my vocal cords, speak directly through me."
  },
  {
    "segment_id": 86,
    "speaker_group": 1,
    "source_text": "The beings I work with are the Pleiadian Collective. So they're a twelfth dimensional collective of beings that, if we were going to assign them a location in our third dimensional version of reality -- Twelfth dimension - how do you even have that? I mean that's even so far out of Earthly terms, but..."
  },
  {
    "segment_id": 87,
    "speaker_group": 1,
    "source_text": "It's different experience, different flavors along with that comes different abilities, different awareness."
  },
  {
    "segment_id": 88,
    "speaker_group": 1,
    "source_text": "So when I say twelfth dimensional Pleiadian Collective - they are a gigantic being of love and light, that knows themselves to be one, and yet understands that they are comprised of many ones, but they do not each individuate themselves like we do here on Earth."
  },
  {
    "segment_id": 89,
    "speaker_group": 1,
    "source_text": "Hence the term 'collective'. So it's not a specific being in particular."
  },
  {
    "segment_id": 90,
    "speaker_group": 1,
    "source_text": "That's correct, but there are specific beings I work with as well. So the Pleiadians are one of many groups and beings I work with. A specific being would be Calliandra, she's a fifth dimensional fairy, so we'll call her a fairy, that's how she presented herself to me. I also work with Yeshua."
  },
  {
    "segment_id": 91,
    "speaker_group": 1,
    "source_text": "I see Yeshua to be a collective being, but we know that being to be an individual entity that we call Jesus on this planet. But I know that energy to be a collective energy."
  },
  {
    "segment_id": 92,
    "speaker_group": 1,
    "source_text": "Or the Archangel Michael at times will come through me, the Lyrans, beings from Lemuria, the Zeta's have made contact with me. It's a very in-the-moment process for me, but the majority of the information I'm accessing at this time is coming from the Pleiadians, Yeshua, and Calliandra, those are kind of the big three for me."
  },
  {
    "segment_id": 93,
    "speaker_group": 1,
    "source_text": "And are you, you're present in your awareness when this happens, it's not like you conk out and then and then you wake up and I go, what happened? I've seen that, I've seen people who have channeled and that's taking place."
  },
  {
    "segment_id": 94,
    "speaker_group": 1,
    "source_text": "Yes, so what you're talking about there is trance channeling. Trance channeling? Yes. What I do is called conscious channeling and/or semi-conscious channeling. And you can even see a difference in me when I'm fully conscious and then when I'm semi-conscious."
  },
  {
    "segment_id": 95,
    "speaker_group": 1,
    "source_text": "So has that happened to you in the past?"
  },
  {
    "segment_id": 96,
    "speaker_group": 1,
    "source_text": "Yes. So the fully conscious channeling is more that, okay, I'm accessing the information, I'm gonna give it to you right now: Reuben, they're telling me: blah blah blah blah blah blah."
  },
  {
    "segment_id": 97,
    "speaker_group": 1,
    "source_text": "So that's almost like, when you work with clients -- Yes."
  },
  {
    "segment_id": 98,
    "speaker_group": 1,
    "source_text": "Hearing it and kind of translating it -- And then I will go into a semi-conscious state with clients as well where then I allow the Pleiadians, Yeshua, whomever in the moment to directly work through my body."
  },
  {
    "segment_id": 99,
    "speaker_group": 1,
    "source_text": "Is there...you must resonate with all the different frequencies otherwise they wouldn't be coming through. Do you have a favorite?"
  },
  {
    "segment_id": 100,
    "speaker_group": 1,
    "source_text": "Or can you not say?"
  },
  {
    "segment_id": 101,
    "speaker_group": 1,
    "source_text": "Do I have a favorite? Depends on the day?"
  },
  {
    "segment_id": 102,
    "speaker_group": 1,
    "source_text": "Yeah, it's really, it's the Pleiadians, Calliandra, and Yeshua. I could not pick one of those out of the three."
  },
  {
    "segment_id": 103,
    "speaker_group": 1,
    "source_text": "However, I'm aware that I have a very specific contract with the Pleiadians."
  },
  {
    "segment_id": 104,
    "speaker_group": 1,
    "source_text": "And I believe that's why they're predominantly coming through right now and I've really noticed that over the last year especially when I go into the semi-conscious direct voice channeling state, it's mostly the Pleiadians transmitting and then occasionally Yeshua, Calliandra, the others, the Lyrans, Lemurians. In the past there used to be more of a variety in my work, so I'm"
  },
  {
    "segment_id": 105,
    "speaker_group": 1,
    "source_text": "very aware that for now, maybe we'll say the Pleiadians are my favorite."
  },
  {
    "segment_id": 106,
    "speaker_group": 1,
    "source_text": "Sorry, Calliandra. Sure she understands. Oh she understands, but she's like this right now."
  },
  {
    "segment_id": 107,
    "speaker_group": 1,
    "source_text": "Well, maybe we can give her some time to voice as well."
  },
  {
    "segment_id": 108,
    "speaker_group": 1,
    "source_text": "Well, in addition to being a channeler, or maybe this goes hand in hand, because you're also clairvoyant or a clairaudient or is that kind of one and the same?"
  },
  {
    "segment_id": 109,
    "speaker_group": 1,
    "source_text": "So language is very interesting because we use it to help us understand and label and then we can often then limit and categorize."
  },
  {
    "segment_id": 110,
    "speaker_group": 1,
    "source_text": "Channels will use their clairvoyant, their clairaudient, they're clairsentient abilities to help them access information. Yes, I am also as Nora however, very intuitive, psychic, clairvoyant, clairaudient, clairsentient."
  },
  {
    "segment_id": 111,
    "speaker_group": 1,
    "source_text": "That's a little bit different from channeling."
  },
  {
    "segment_id": 112,
    "speaker_group": 1,
    "source_text": "Yes, that's me using my own operating system."
  },
  {
    "segment_id": 113,
    "speaker_group": 1,
    "source_text": "So and you have those abilities as well. Awesome."
  },
  {
    "segment_id": 114,
    "speaker_group": 1,
    "source_text": "Because I've talked with other, I guess, intuitive people, in quotes, where to me and after hearing the process, it sounds like they were just tapping into like more channel type you know."
  },
  {
    "segment_id": 115,
    "speaker_group": 1,
    "source_text": "Well, it wasn't me, it was I heard a voice and this is this is what I'm getting, and you know, most the time it's accurate so.. But I just wondered how your operating system works?"
  },
  {
    "segment_id": 116,
    "speaker_group": 1,
    "source_text": "Yes, and really when it comes down to it, it's all information coming from source energy. Whether you access it directly in your own body or you access it from a vibration or a frequency outside of you. We are all source, we are all that love energy incarnate. It's just fun to get to do it different ways. That's one of the gifts of being here on planet Earth, we get the"
  },
  {
    "segment_id": 117,
    "speaker_group": 1,
    "source_text": "variety and the selection."
  },
  {
    "segment_id": 118,
    "speaker_group": 1,
    "source_text": "And you know and yeah getting to that and maybe this is a question later for the Pleiadians, but by giving it these labels, is that just more because I've noticed some people who are new to the intuitive side of things they're feeling energies, they're hearing it, but they don't, maybe they don't know how to categorize them right or is it even appropriate to categorize it?"
  },
  {
    "segment_id": 119,
    "speaker_group": 1,
    "source_text": "How does that, you know how does that all-- when ultimately we're trying to get to a place where we're not labeling anything at all. How does that help us and does that serve us?"
  },
  {
    "segment_id": 120,
    "speaker_group": 1,
    "source_text": "I think it helps initially to label, categorize, to help the mental body catch up and understand what it is you're already doing in your emotional and energetic and physical bodies and then once you achieve that level of understanding, it's very important to release the labels and the attachments and just be in the moment."
  },
  {
    "segment_id": 121,
    "speaker_group": 1,
    "source_text": "Because then your mind has relaxed. So the mental body was really set up to filter out the third dimensional mental body. Was set up to filter out all of this input, all of this information."
  },
  {
    "segment_id": 122,
    "speaker_group": 1,
    "source_text": "Zoe, you're now part of the movie, officially."
  },
  {
    "segment_id": 123,
    "speaker_group": 1,
    "source_text": "So this is Zoe. Zoe is an elf and a unicorn. We like to call Zoe the Alphacorn because she brings through the elfin and the unicorn energies strongly in our space."
  },
  {
    "segment_id": 124,
    "speaker_group": 1,
    "source_text": "We have a couple of cats, one is bringing through the fairy vibration and the other Pleiadian frequency and vibration. Animals, they are definitely helping us here on so many levels. We've had Zoe now for just a little over a year and she has brought with her such an amazing transmission of unconditional love and fun and play, our entire reality has shifted with her presence."
  },
  {
    "segment_id": 125,
    "speaker_group": 1,
    "source_text": "I've noticed that with animals, if humans could operate on an animal level in so many ways that you know where we... it's like they do something and we're mad at them but then they're in the doghouse so to say, but two minutes later they're: oh I didn't do anything, or I forgive you or whatever. You know they can't, even if you are physically angry with them or something, they'll you know:"
  },
  {
    "segment_id": 126,
    "speaker_group": 1,
    "source_text": "it's okay, the ultimate show of how to forgive."
  },
  {
    "segment_id": 127,
    "speaker_group": 1,
    "source_text": "Yes. And also how to be present."
  },
  {
    "segment_id": 128,
    "speaker_group": 1,
    "source_text": "They're extremely in the moment, they don't tie their moments together in the way that we do and they also don't filter out the information that our mental bodies filter out. Coming back to, back around to that -- thank you, Zoe -- so I'm aware that Zoey and Izzy and Ursula the Smurf, our cats, are always interacting with the beings that are present in our space."
  },
  {
    "segment_id": 129,
    "speaker_group": 1,
    "source_text": "I see them watching the beings and seeing things that I can't access in the moment."
  },
  {
    "segment_id": 130,
    "speaker_group": 1,
    "source_text": "Excellent. Well thanks guys, let us know if something pops in here, maybe we'll catch it on film."
  },
  {
    "segment_id": 131,
    "speaker_group": 1,
    "source_text": "Well, I guess the last question before we move in is: when you were trying to find labels I guess, or if you weren't even trying but did they present themselves and say I am such and such, I am Pleiadian Collective, I am Calliandra. Is that how it happened or were you able to... how did that come to you, for each? So initially it wasn't that easy. Okay yeah, that's what I figured,"
  },
  {
    "segment_id": 132,
    "speaker_group": 1,
    "source_text": "I knew there'd be a story to this. With the Pleiadians it was easy. Immediately I recognized that the transmission from the Pleiadians as a Pleiadian transmission."
  },
  {
    "segment_id": 133,
    "speaker_group": 1,
    "source_text": "I recognized it in my body, in a visceral way. It was very clear to me that's who I was in contact with, and I'd been aware of the Pleiadian energy so my mental body had already accepted the truth of the Pleiadian Collective and their work with us here on Earth. So when they made direct contact with me, my mental body didn't freak out and try to screen out that piece of information, it"
  },
  {
    "segment_id": 134,
    "speaker_group": 1,
    "source_text": "was clear to me. Now many of the other beings that I've worked with, it's taken me some time to kind of work my way into discerning who it was I was connecting with. Now when I say time, I mean perhaps a matter of minutes or hours, yes. It's never been longer than that and that's just I guess part of my operating system."
  },
  {
    "segment_id": 135,
    "speaker_group": 1,
    "source_text": "Calliandra, for instance, when she first made herself known to me, I felt a new being link up with me -- I was preparing for radio interview that night -- I could feel this really wonderful playful presence, and immediately I knew it to be fairy. So again Nora had accepted fairies, that was easy, ah I know this vibration to be fairy. So I asked for a name and I got the name initially Calliana. So I was"
  },
  {
    "segment_id": 136,
    "speaker_group": 1,
    "source_text": "playing with Calliana, I was like okay, and I thought no, that's not quite right, and then I got Calliandra -- got it."
  },
  {
    "segment_id": 137,
    "speaker_group": 1,
    "source_text": "As soon as I heard, felt, that's really predominantly how I access information when I'm not in the semi-conscious direct voice channeling state, ok? So when Nora is conscious and awake, and when I choose to seek out information as Nora, meaning information I can't just read from a book or you know, I feel it and I hear it. I hear the words. I see it."
  },
  {
    "segment_id": 138,
    "speaker_group": 1,
    "source_text": "I see it sometimes like words on the paper. I see the story. Very occasionally I access more of my clairvoyant abilities, meaning I will see an image, I'll see some light, I'll see a story playing out in my mind's eye. So I felt, heard, the name Calliandra and thought okay her name is Calliandra. And then I had to go outside and ground myself because I was working with a new vibration, a new"
  },
  {
    "segment_id": 139,
    "speaker_group": 1,
    "source_text": "frequency and I found it actually really powerful and intense to work with a fifth dimensional being. So I was used to working with these very, very high vibrations and high frequencies which were in some ways easier to work with because it's so... well, any of you listening right now, if you just take a breath, you can tune into that light high, high vibration. Imagine it's"
  },
  {
    "segment_id": 140,
    "speaker_group": 1,
    "source_text": "like interacting with a cloud, yes, gentle easy, right. Calliandra was like interacting with a sledgehammer, her energy was so powerful because she has more density to her vibration as a fifth dimensional being. So I had to go outside and stand on the ground. And then I came in and sat in front of my computer and I thought I'm gonna look up the word Calliandra and see what I find, because I"
  },
  {
    "segment_id": 141,
    "speaker_group": 1,
    "source_text": "like to also, if I can, back up my other dimensional information with third dimensional information and I googled the word Calliandra, and it's a plant called Fairy Duster and I'd not ever heard that word before and it was such a moment of validation for me, which was great. I was gonna go on the radio that night and introduce a new being, so how wonderful that I got that."
  },
  {
    "segment_id": 142,
    "speaker_group": 1,
    "source_text": "So the information you got was Calliandra the fairy and then the validation was caught under the name..."
  },
  {
    "segment_id": 143,
    "speaker_group": 1,
    "source_text": "So that took me a couple of hours to answer that question and discerning frequencies and vibrations. Sometimes when I'm working with a client and someone who's passed, connects up with me, you know sometimes I'll feel immediately like oh this is their mother whose passed. And that's work that I don't do a lot of but I do do it occasionally when it's necessary. They will present themselves"
  },
  {
    "segment_id": 144,
    "speaker_group": 1,
    "source_text": "to me and then typically I'll just ask them questions of the client you know where's your mother is usually how I'll start, as opposed to I've made contact with your mother, because that can be startling for somebody who's lost..."
  },
  {
    "segment_id": 145,
    "speaker_group": 1,
    "source_text": "But how about so-called dark energies or even manipulating tricksters or these kinds of, you know, what we see typically in the movies..."
  },
  {
    "segment_id": 146,
    "speaker_group": 1,
    "source_text": "Actually this whole experience, you know, channeling, has kind of been made quite negative in our media and with you know, like \"The Exorcist\" and these kinds of things. So I've interacted especially when I first started channeling, had a couple of interactions with energies that felt, that seemed to be wanting to guide, and seemed to be wanting to give information and so initially it"
  },
  {
    "segment_id": 147,
    "speaker_group": 1,
    "source_text": "was interesting and then, what I found happening was I started feeling afraid."
  },
  {
    "segment_id": 148,
    "speaker_group": 1,
    "source_text": "Not of the being itself but of the information they were giving me, it was causing me to feel afraid. Afraid that I wasn't going to have what I wanted in my life, afraid that I wasn't really powerful. So that's.. then I become aware, oh I'm accessing another vibrational energy that I don't want to be playing with. And then I would just.. And that's how you could kind of discern"
  },
  {
    "segment_id": 149,
    "speaker_group": 1,
    "source_text": "which energy is there, just if it's doing some..., if it's putting you in a fear-based state. If you're accessing an energy and you start to feel bad in your body, it's not really an energy you want to be playing with. So the thing to do then is to just send a big transmission of unconditional love to that being, and raise your own vibration. That clears the being out of"
  },
  {
    "segment_id": 150,
    "speaker_group": 1,
    "source_text": "your space, it raises your energy. Then you're able to reconnect with those higher vibrational beings, and then you can always - as well, if you're already channeling, so if you're familiar with the process, you can call on a being that you know to be of a higher vibrational nature that you're familiar with, to kind of reconnect, solidify those connections."
  },
  {
    "segment_id": 151,
    "speaker_group": 1,
    "source_text": "I've heard of cases where energies start out good, it's almost like almost like the church, you know start out good, with good love and light messages and get people in and then somewhere down the path the message can kind of turn and then start putting people in a fear-based situation and then usually after they get a bunch of people kind of already in, and you know"
  },
  {
    "segment_id": 152,
    "speaker_group": 1,
    "source_text": "very much like a church type scenario."
  },
  {
    "segment_id": 153,
    "speaker_group": 1,
    "source_text": "Well the other issue that you're touching on here is, you know as a channel, you still have an ego. So often what will happen is, in those situations, the energy itself stays in that high vibrational state - it's the filter that alters, meaning the channel."
  },
  {
    "segment_id": 154,
    "speaker_group": 1,
    "source_text": "So I'm constantly checking my filter. I'm constantly having to disengage from any personal intention or attachment to anything personally for Nora, while channeling, or the person I'm channeling for. So if I were channeling for you, Reuben, in a private session and I had a particular desire for you, for your success let's say? If I was attached to that, that would cloud my ability to"
  },
  {
    "segment_id": 155,
    "speaker_group": 1,
    "source_text": "clearly discern the information that's coming through and I'd put my own spin on it."
  },
  {
    "segment_id": 156,
    "speaker_group": 1,
    "source_text": "So what you're talking about I think are those cults that have come up around channels and things like that, it's, you know, there's an imperative underneath that the channel was running for a prosperity issue or relationship issue or sexual issue or whatever it is."
  },
  {
    "segment_id": 157,
    "speaker_group": 1,
    "source_text": "And suddenly 'the being' is recommending everyone hand over their money, when really, it's the channel speaking and the being has no control over that."
  },
  {
    "segment_id": 158,
    "speaker_group": 1,
    "source_text": "So that's the other wonderful thing about this co-creative work in channeling."
  },
  {
    "segment_id": 159,
    "speaker_group": 1,
    "source_text": "I can only bring through what I allow myself to bring through. They can't force me to do anything. So I can alter the message, really, any time I want."
  },
  {
    "segment_id": 160,
    "speaker_group": 1,
    "source_text": "You really have to keep yourself in check though?"
  },
  {
    "segment_id": 161,
    "speaker_group": 1,
    "source_text": "Yeah - and I have a lot of lessons that I've experienced in this lifetime to remind me to keep myself in check."
  },
  {
    "segment_id": 162,
    "speaker_group": 1,
    "source_text": "I'm sure they're guiding and helping you do that."
  },
  {
    "segment_id": 163,
    "speaker_group": 1,
    "source_text": "Yes, yes."
  },
  {
    "segment_id": 164,
    "speaker_group": 1,
    "source_text": "As long as you're paying attention."
  },
  {
    "segment_id": 165,
    "speaker_group": 1,
    "source_text": "And I guess when those others, that we talked about, probably aren't paying attention or you know they're not, I'm sure those higher beings are probably screaming at them and then the ego kicks in and tunes them out."
  },
  {
    "segment_id": 166,
    "speaker_group": 1,
    "source_text": "I think those things happen for karmic reasons or because they've got trauma they haven't resolved, and that trauma begins to spin this tale."
  },
  {
    "segment_id": 167,
    "speaker_group": 1,
    "source_text": "But the other thing you've got to look at here is anybody who gets pulled in by something like that, they are a co-creator in that experience as well."
  },
  {
    "segment_id": 168,
    "speaker_group": 1,
    "source_text": "They are willingly handing over their free will to that entity or that higher being and that's their lesson as well. So then the channel who's bringing through the information in that way with their own, perhaps, distorted filter is suddenly serving to offer this lesson to anybody who wants to hand over their free will and forget they're sovereign."
  },
  {
    "segment_id": 169,
    "speaker_group": 1,
    "source_text": "Man, so many people hand over that free will so easily."
  },
  {
    "segment_id": 170,
    "speaker_group": 1,
    "source_text": "Well, we're also programmed to be enslaved, so we really..."
  },
  {
    "segment_id": 171,
    "speaker_group": 1,
    "source_text": "Is that a DNA programming, you think, or is that..?"
  },
  {
    "segment_id": 172,
    "speaker_group": 1,
    "source_text": "It's in our genetic code and it's something that we're in the process of rewriting as we integrate our higher selves because our higher selves don't have that imperative to run the enslavement games."
  },
  {
    "segment_id": 173,
    "speaker_group": 1,
    "source_text": "They don't have genetics, do they?"
  },
  {
    "segment_id": 174,
    "speaker_group": 1,
    "source_text": "Well, they don't but, as we're integrating our higher selves into our third dimensional chakra system, our higher selves are interacting with our physical genetic structure.  Now I'm a bit going into the channeling state, so I'm not fully direct voice channeling, but if you're paying attention to me you're going to see I look a little different right now because my eyes are starting"
  },
  {
    "segment_id": 175,
    "speaker_group": 1,
    "source_text": "to get a, have a different focus, so the Pleiadians are just reminding us right now that as we integrate our higher selves we are altering ourselves from the inside out physically, genetically as well and we're breaking down... Greetings!"
  },
  {
    "segment_id": 176,
    "speaker_group": 1,
    "source_text": "This is the Pleiadians Collective as always, it's wonderful to have the opportunity to link up with you in this way, and we'll give you back Nora if you need her again? No this is a good transition."
  }
]