[{"segment_id":1,"speaker_group":1,"source_text":"It is the idea of many of our species..."},{"segment_id":2,"speaker_group":1,"source_text":"What we would say in other star systems coming into understanding that there is a balance and so we allow all to happen the way it is and to interact the way it will be."},{"segment_id":3,"speaker_group":1,"source_text":"Otherwise we ourselves cannot expand if we do not understand one another's perspectives."},{"segment_id":4,"speaker_group":1,"source_text":"We, or the Anunnaki the creators, are expanding in just the same as human consciousness is, and that was previously misunderstood."},{"segment_id":5,"speaker_group":1,"source_text":"Living in this third density has been beneficial for your learning because now you can become the teachers, and expand even more fully into the source energy that we are all trying to what you might say make sense of or understand within our hearts."},{"segment_id":6,"speaker_group":1,"source_text":"Because you see that there is a paradigm allowed here on Earth, or a sort of \"Game Shift\", you understand perhaps the mindsets that can trap you into that space."},{"segment_id":7,"speaker_group":1,"source_text":"There are others elsewhere that have fairly similar mindsets, perhaps you can be their guides and teach them ways to expand past what you call \"The Matrix\" to \"The Game Playing\" but how would you know if you hadn't had some of that in your perspective?"},{"segment_id":8,"speaker_group":1,"source_text":"Ever wonder if there's intelligent life elsewhere in the universe?"},{"segment_id":9,"speaker_group":1,"source_text":"Well, I have....I've been wondering since I was a kid."},{"segment_id":10,"speaker_group":1,"source_text":"My name is Reuben Langdon."},{"segment_id":11,"speaker_group":1,"source_text":"And on March 29th 2007, in the middle of the day, I saw a number of strange objects in the sky."},{"segment_id":12,"speaker_group":1,"source_text":"Coincidentally, I was working on the film Avatar at the time, playing an alien."},{"segment_id":13,"speaker_group":1,"source_text":"And ever since then I've been on a quest..."},{"segment_id":14,"speaker_group":1,"source_text":"A quest to find out if aliens really do exist and if so... ...are they here with us?"},{"segment_id":15,"speaker_group":1,"source_text":"If beings of higher intelligence are here... ...what is their purpose?"},{"segment_id":16,"speaker_group":1,"source_text":"Why don't they make themselves more known?"},{"segment_id":17,"speaker_group":1,"source_text":"Why the secrecy?"},{"segment_id":18,"speaker_group":1,"source_text":"I've asked these questions to many experts, yet each seems to have a different theory."},{"segment_id":19,"speaker_group":1,"source_text":"So I thought to myself, why not ask the aliens directly?"},{"segment_id":20,"speaker_group":1,"source_text":"So that's what I set out to do!"},{"segment_id":21,"speaker_group":1,"source_text":"Well, sort of..."},{"segment_id":22,"speaker_group":2,"source_text":"OK."},{"segment_id":23,"speaker_group":2,"source_text":"So I have a few visuals."},{"segment_id":24,"speaker_group":2,"source_text":"I feel like my strongest one is a woman from the council, as well as, I would say, an insectoid."},{"segment_id":25,"speaker_group":3,"source_text":"OK."},{"segment_id":26,"speaker_group":4,"source_text":"I would say Gray, but it's tall, skinny, and it has more of antenna-style, instead of a human face, if that makes sense."},{"segment_id":27,"speaker_group":5,"source_text":"Mm-hm."},{"segment_id":28,"speaker_group":5,"source_text":"Maybe closer to a Mantis?"},{"segment_id":29,"speaker_group":6,"source_text":"Yeah, similar to that type of breed, or if that's what you call it?"},{"segment_id":30,"speaker_group":6,"source_text":"So depending on the question, those are the two collectives that want to answer."},{"segment_id":31,"speaker_group":6,"source_text":"OK, so depending on how far back or what question, the Draco also wants to respond."},{"segment_id":32,"speaker_group":6,"source_text":"He says, most particularly, if he references the shift over, which-- what we were talking about, when the beings came in and basically took over our consciousness, he knows a lot about that time period."},{"segment_id":33,"speaker_group":7,"source_text":"OK."},{"segment_id":34,"speaker_group":7,"source_text":"Well, let's start with Atlantis."},{"segment_id":35,"speaker_group":8,"source_text":"OK."},{"segment_id":36,"speaker_group":9,"source_text":"And I hate to put a timeline on things, but I'm guessing around 25,000 years ago?"},{"segment_id":37,"speaker_group":10,"source_text":"OK."},{"segment_id":38,"speaker_group":10,"source_text":"OK, so the woman says further back than that, my love, but yes."},{"segment_id":39,"speaker_group":10,"source_text":"A very special time period indeed."},{"segment_id":40,"speaker_group":10,"source_text":"What is it that you would like to know?"},{"segment_id":41,"speaker_group":11,"source_text":"Is that-- because I've heard from other channels and other guides that humanity carries a lot of trauma from the Atlantean periods."},{"segment_id":42,"speaker_group":11,"source_text":"So I guess my question would be, is much of what we're dealing with on the planet now, is it tied into the Atlantean energy?"},{"segment_id":43,"speaker_group":12,"source_text":"She says, I'm not sure if I would call it traumas, though it does take some healing to transform what has been learned during this time period and where you are moving toward."},{"segment_id":44,"speaker_group":12,"source_text":"She says, you see, during the Atlantean time period, consciousness had grown exponentially and experiments were taking place."},{"segment_id":45,"speaker_group":12,"source_text":"And yes, humanity as well as other species had to learn that this is not how expansion was to occur in the most beneficial way."},{"segment_id":46,"speaker_group":12,"source_text":"So those that understood this opted into a alternative experience-- an experience where they could learn in a slightly different way."},{"segment_id":47,"speaker_group":12,"source_text":"So you may call it traumatic in the sense that what once was known was erased or taken, but we would also like to call it a teaching or learning opportunity for the expansion of humanity that they opted into."},{"segment_id":48,"speaker_group":13,"source_text":"Was the Annunaki DNA injection, was that prior or after the Atlantean experience?"},{"segment_id":49,"speaker_group":13,"source_text":"In our linear sense of time."},{"segment_id":50,"speaker_group":14,"source_text":"She says, right prior to the diluvian time period with the Annunaki, but there seems to be a disconnect with what she's showing me."},{"segment_id":51,"speaker_group":14,"source_text":"I'm seeing if she can use verbals."},{"segment_id":52,"speaker_group":14,"source_text":"Basically, there seemed to be an Atlantean time period further back from when the Annunaki actually came and created their hybrid human."},{"segment_id":53,"speaker_group":14,"source_text":"And then she's showing me that, with the diluvian waters, they erased all of this."},{"segment_id":54,"speaker_group":14,"source_text":"But some Annunaki saved some of the humanoid to carry on that genetic map that they created."},{"segment_id":55,"speaker_group":15,"source_text":"When you say \"diluvian,\" can you go into more detail about that?"},{"segment_id":56,"speaker_group":15,"source_text":"What does that mean?"},{"segment_id":57,"speaker_group":16,"source_text":"She says the great flood that we have known to be called the great flood."},{"segment_id":58,"speaker_group":16,"source_text":"She says, this is a common misconception in understanding the human evolution, because there were humanoids in the Atlantean time period, but we would suggest that they were more 5th dimensional beings."},{"segment_id":59,"speaker_group":16,"source_text":"They were not essentially what the human is today."},{"segment_id":60,"speaker_group":16,"source_text":"That human is the creation of what the Annunaki created right prior to this diluvian time period."},{"segment_id":61,"speaker_group":17,"source_text":"But the Annunaki borrowed some DNA from that time period, or from that energy?"},{"segment_id":62,"speaker_group":17,"source_text":"Or is that just, I guess, the Atlantean karma that we're dealing with, is that just more energetic as opposed to DNA?"},{"segment_id":63,"speaker_group":18,"source_text":"OK."},{"segment_id":64,"speaker_group":18,"source_text":"That's a good question."},{"segment_id":65,"speaker_group":18,"source_text":"She says, with reference to your question, I would say that this is more energetic."},{"segment_id":66,"speaker_group":18,"source_text":"It is a consciousness that was tampered with in order to bring in the consciousness of a humanoid."},{"segment_id":67,"speaker_group":18,"source_text":"She says, once again, the Atlanteans were, she says, like a type of human species."},{"segment_id":68,"speaker_group":18,"source_text":"But they-- she's saying they're not what you exactly think, and I'm asking her if she can be more specific with the details of how this all occurred."},{"segment_id":69,"speaker_group":18,"source_text":"She says, basically, it's a different type of humanoid."},{"segment_id":70,"speaker_group":18,"source_text":"It's a higher-evolved human conscience that was there."},{"segment_id":71,"speaker_group":18,"source_text":"It's different than what the Annunaki created."},{"segment_id":72,"speaker_group":19,"source_text":"Is it a mixture of different beings?"},{"segment_id":73,"speaker_group":19,"source_text":"Where there Pleiadians, and Mantoids, and--"},{"segment_id":74,"speaker_group":20,"source_text":"She says yes."},{"segment_id":75,"speaker_group":21,"source_text":"--Lyrans, and they were all just having a big party?"},{"segment_id":76,"speaker_group":22,"source_text":"She says yes, but there were also very select that had a specific type of DNA."},{"segment_id":77,"speaker_group":22,"source_text":"But then things started to get mixed in an experimental way, she says, not in necessarily a mating way."},{"segment_id":78,"speaker_group":22,"source_text":"The Annunaki efforts evolved into a mating energetic manipulation of the DNA."},{"segment_id":79,"speaker_group":23,"source_text":"So did the Annunaki come after the Atlantean destruction?"},{"segment_id":80,"speaker_group":23,"source_text":"Was this great diluvian flood, was that a reaction to the Atlantean experimentation in technology and energy?"},{"segment_id":81,"speaker_group":24,"source_text":"She's saying we think the Atlantean happened before as far as linear time period compared to when the Annunaki came and actually manipulated the human DNA."},{"segment_id":82,"speaker_group":24,"source_text":"And there seems to be a disconnect with the human in Atlantean time period versus the human that the Annunaki created."},{"segment_id":83,"speaker_group":24,"source_text":"There's a little bit different--"},{"segment_id":84,"speaker_group":25,"source_text":"Energy?"},{"segment_id":85,"speaker_group":26,"source_text":"--energy, and the dimensional frequency that that human is capable of being a part of."},{"segment_id":86,"speaker_group":27,"source_text":"What density was the Atlantean experience?"},{"segment_id":87,"speaker_group":28,"source_text":"OK."},{"segment_id":88,"speaker_group":28,"source_text":"She says it's the fifth dimension, fourth density."},{"segment_id":89,"speaker_group":29,"source_text":"OK."},{"segment_id":90,"speaker_group":30,"source_text":"She's saying, part of the confusion could be the shifting of the Earth, and the part of waters rising."},{"segment_id":91,"speaker_group":30,"source_text":"She's saying that the flood that we're speaking of, the deluge right after the Annunaki manipulated the human genome--"},{"segment_id":92,"speaker_group":31,"source_text":"Oh, this is a second flood."},{"segment_id":93,"speaker_group":32,"source_text":"There seems to be different floodings."},{"segment_id":94,"speaker_group":32,"source_text":"The great deluge, she's saying, was intentional."},{"segment_id":95,"speaker_group":32,"source_text":"The flood that took out Atlantis, she's saying, was a shifting of the planet."},{"segment_id":96,"speaker_group":32,"source_text":"And then there was another shifting later down the road, after the deluge, if that makes sense."},{"segment_id":97,"speaker_group":33,"source_text":"Yeah."},{"segment_id":98,"speaker_group":34,"source_text":"She's just basically apologizing for the timelines of trying to construct in our minds how it all played out."},{"segment_id":99,"speaker_group":34,"source_text":"But she understands it with the evolution of how the Earth has cycled through."},{"segment_id":100,"speaker_group":34,"source_text":"She's saying that there were other things that happened during the Atlantean time period that took the destruction."},{"segment_id":101,"speaker_group":34,"source_text":"Chemical warfare, wars."},{"segment_id":102,"speaker_group":34,"source_text":"The waters could be manipulated, but they weren't used for this specific purpose as they were in the deluge that we speak of, the great flooding that was meant to wipe out and reset the human species."},{"segment_id":103,"speaker_group":35,"source_text":"She says, in a linear format, it would be Atlantean time period in a fifth-dimensional state with wars of chemicals, experimentation, and these sorts."},{"segment_id":104,"speaker_group":35,"source_text":"And the Earth changed and shifted accordingly."},{"segment_id":105,"speaker_group":35,"source_text":"And the waters rose, and even the land shifted and changed."},{"segment_id":106,"speaker_group":35,"source_text":"And then we could say that, for some time, Earth was desolate."},{"segment_id":107,"speaker_group":35,"source_text":"And that's when the Annunaki came."},{"segment_id":108,"speaker_group":35,"source_text":"And they created the humanoid based on their needs."},{"segment_id":109,"speaker_group":35,"source_text":"And she says things began to spiral out of control, in a sense, where they were repeating the Atlantean time period with their experimentation, and understood that now they would have to deal with the energy accordingly, and created a flooding to reset the species."},{"segment_id":110,"speaker_group":36,"source_text":"Mm-hm."},{"segment_id":111,"speaker_group":36,"source_text":"So the Annunaki actually created the flood."},{"segment_id":112,"speaker_group":37,"source_text":"She says yes."},{"segment_id":113,"speaker_group":38,"source_text":"Was this coming from the higher-ups because they So were they ordered to do the flood?"},{"segment_id":114,"speaker_group":39,"source_text":"She says they didn't-- it was not an order."},{"segment_id":115,"speaker_group":39,"source_text":"They felt that a reset was necessary in order to undo the karmic energy that they had done."},{"segment_id":116,"speaker_group":39,"source_text":"She's bringing me back to Atlantis, which is telling me that they understood that the energy that was created in Atlantis with the experimentation led to-- I don't want, if you say bad karma, or a learning curve."},{"segment_id":117,"speaker_group":39,"source_text":"They didn't want to do that, so they decided, let's reset everything, and let's just make it right."},{"segment_id":118,"speaker_group":39,"source_text":"And so they created this flooding area."},{"segment_id":119,"speaker_group":39,"source_text":"OK, sorry."},{"segment_id":120,"speaker_group":39,"source_text":"She's doing a lot more visuals than verbals."},{"segment_id":121,"speaker_group":39,"source_text":"She's showing me, though, that many were actually sent away from where the flood was to preserve."},{"segment_id":122,"speaker_group":39,"source_text":"But they also felt like they were getting outnumbered, in a sense, and were trying to just select a few of the genomes that they wanted to preserve."},{"segment_id":123,"speaker_group":39,"source_text":"She says it basically, in their minds, was a reset so they wouldn't have to do some of the energetic balance that Atlantis had to come face to face with."},{"segment_id":124,"speaker_group":40,"source_text":"But it still sounds like we're repeating ourselves over and over again."},{"segment_id":125,"speaker_group":41,"source_text":"Yeah."},{"segment_id":126,"speaker_group":41,"source_text":"She says it's been very-- she says karmic."},{"segment_id":127,"speaker_group":41,"source_text":"It's been very karmic."},{"segment_id":128,"speaker_group":42,"source_text":"It sounds almost like \"Groundhog Day.\""},{"segment_id":129,"speaker_group":43,"source_text":"She says you cannot create a species and say, oh, no, what have I done?"},{"segment_id":130,"speaker_group":43,"source_text":"Let's reset."},{"segment_id":131,"speaker_group":43,"source_text":"She says, you cannot do this."},{"segment_id":132,"speaker_group":43,"source_text":"And so the creators-- the Annunaki that you call them-- have had to go through their own set of learning processes to redo the human species, and not in the way that they had previously planned in annihilating the genome."},{"segment_id":133,"speaker_group":43,"source_text":"They must help them into higher consciousness."},{"segment_id":134,"speaker_group":44,"source_text":"So they're our guides now."},{"segment_id":135,"speaker_group":45,"source_text":"She says, many have stepped forward to try to help."},{"segment_id":136,"speaker_group":46,"source_text":"Mm-hm."},{"segment_id":137,"speaker_group":46,"source_text":"Does the Annunaki civilization that came initially to create this species, does that still exist in a fourth density, or in a physical form?"},{"segment_id":138,"speaker_group":46,"source_text":"Fourth or fifth?"},{"segment_id":139,"speaker_group":47,"source_text":"She says, not in the way that you would understand."},{"segment_id":140,"speaker_group":47,"source_text":"It has surpassed."},{"segment_id":141,"speaker_group":47,"source_text":"They have, she says, tried to help in many instances."},{"segment_id":142,"speaker_group":47,"source_text":"And they have evolved to be more light beings, in a sense."},{"segment_id":143,"speaker_group":47,"source_text":"They have stood by humanity on a larger scale, and have tried to help."},{"segment_id":144,"speaker_group":47,"source_text":"And for this, they have evolved greatly."},{"segment_id":145,"speaker_group":47,"source_text":"We would say that they are further in dimension than what you speak of."},{"segment_id":146,"speaker_group":48,"source_text":"Almost a collective?"},{"segment_id":147,"speaker_group":49,"source_text":"She says yes, but they still desire to help humanity evolve because of the karmic cycle that had been created."},{"segment_id":148,"speaker_group":49,"source_text":"Because their greatest desire is expansion as well."},{"segment_id":149,"speaker_group":50,"source_text":"It's been said that we have DNA from various species-- Pleiadian, Reptilian, Lyran."},{"segment_id":150,"speaker_group":50,"source_text":"I'm sure there's many more."},{"segment_id":151,"speaker_group":50,"source_text":"Even Arcturian, and-- are all of these different types of DNA mixed in into the Annunaki DNA already?"},{"segment_id":152,"speaker_group":50,"source_text":"Is that where we get it from?"},{"segment_id":153,"speaker_group":50,"source_text":"Or did they take from these other--"},{"segment_id":154,"speaker_group":51,"source_text":"She says they didn't take."},{"segment_id":155,"speaker_group":51,"source_text":"Borrowed for other trades."},{"segment_id":156,"speaker_group":51,"source_text":"Their DNA is not 100% your DNA."},{"segment_id":157,"speaker_group":51,"source_text":"Your DNA is unique in the fact that it comes from all different star systems."},{"segment_id":158,"speaker_group":51,"source_text":"And they knew that in order to create the perfect humanoid, they needed to do this."},{"segment_id":159,"speaker_group":52,"source_text":"What was their goal?"},{"segment_id":160,"speaker_group":52,"source_text":"I keep hearing it sounds like it was more complicated than just to create a species to mine their gold."},{"segment_id":161,"speaker_group":53,"source_text":"She's saying conquering other worlds."},{"segment_id":162,"speaker_group":53,"source_text":"I'm asking her to clarify what she means by that."},{"segment_id":163,"speaker_group":53,"source_text":"Being able to inhabit this world, and to conquer it, and move on to others, it is almost like having children and letting them rule the planet."},{"segment_id":164,"speaker_group":53,"source_text":"She says it wasn't meant to be negative."},{"segment_id":165,"speaker_group":53,"source_text":"It's just to have a planet-- a dominionship, and then to move forward into other planetary regions, and to rule that."},{"segment_id":166,"speaker_group":54,"source_text":"It sounds almost Reptilian."},{"segment_id":167,"speaker_group":54,"source_text":"Is that consciousness prevalent in the Anunnaki?"},{"segment_id":168,"speaker_group":55,"source_text":"She's smiling."},{"segment_id":169,"speaker_group":55,"source_text":"She says, it's not only Reptilian, but yes, you are correct."},{"segment_id":170,"speaker_group":55,"source_text":"The Anunnaki are very-- kinship?"},{"segment_id":171,"speaker_group":55,"source_text":"Very ruling-ship type."},{"segment_id":172,"speaker_group":55,"source_text":"And they create and procreate based on the fact that they can pass down to their family, she says, like, regions."},{"segment_id":173,"speaker_group":56,"source_text":"Heirs."},{"segment_id":174,"speaker_group":56,"source_text":"Heirs to the kingdom."},{"segment_id":175,"speaker_group":57,"source_text":"Yeah, in regions."},{"segment_id":176,"speaker_group":57,"source_text":"And in this case, it was a planet."},{"segment_id":177,"speaker_group":58,"source_text":"Mm-hm."},{"segment_id":178,"speaker_group":59,"source_text":"It sounds-- because that still has a hierarchy-type, ownership-type energy to it."},{"segment_id":179,"speaker_group":59,"source_text":"It sounds like maybe the Anunnaki have moved beyond that now?"},{"segment_id":180,"speaker_group":60,"source_text":"She says we believe that they have."},{"segment_id":181,"speaker_group":60,"source_text":"They are working hard to undo the mindsets and the consciousness that are now unbeneficial to you that they have created."},{"segment_id":182,"speaker_group":60,"source_text":"She says, you do see yourselves often as hierarchical beings, and have organized your world accordingly."},{"segment_id":183,"speaker_group":60,"source_text":"This comes from the Anunnaki, and they understand this, and they are working to unfold this."},{"segment_id":184,"speaker_group":60,"source_text":"She says, but there are benefits to having a hierarchical system, and they understand this as well."},{"segment_id":185,"speaker_group":60,"source_text":"The key is to maintain that we are all unified, and we all have our special role within God source energy."},{"segment_id":186,"speaker_group":60,"source_text":"It sounds like, maybe because we have this Anunnaki hierarchical energy, that maybe we were open to-- ...to inviting a Reptilian energy at some point."},{"segment_id":187,"speaker_group":61,"source_text":"She says you are very correct in believing this."},{"segment_id":188,"speaker_group":61,"source_text":"The Reptilians have a very compassionless perspective, and so their idea is to dominate."},{"segment_id":189,"speaker_group":61,"source_text":"But keep in mind that the Anunnaki as a whole is not just Reptilian."},{"segment_id":190,"speaker_group":61,"source_text":"They are-- she's saying a unique species."},{"segment_id":191,"speaker_group":61,"source_text":"I'm asking her to pinpoint if I can get a region."},{"segment_id":192,"speaker_group":62,"source_text":"Sounds almost Orion."},{"segment_id":193,"speaker_group":63,"source_text":"I'm getting like a conglomerate of maybe just-- I feel like there are Reptilian in this region, and also, like, blondes."},{"segment_id":194,"speaker_group":64,"source_text":"Pleiadians."},{"segment_id":195,"speaker_group":65,"source_text":"Yeah."},{"segment_id":196,"speaker_group":65,"source_text":"And I feel like they're working together, and that's who we call the Annunaki."},{"segment_id":197,"speaker_group":65,"source_text":"And I even feel like there's Insectoids involved with this."},{"segment_id":198,"speaker_group":65,"source_text":"So we have Reptilian, Insectoids, and the Humanoid, or the Pleiades part of Orion being the Anunnaki creators."},{"segment_id":199,"speaker_group":66,"source_text":"What are the Insectoids' roles in this mix?"},{"segment_id":200,"speaker_group":67,"source_text":"Donating DNA."},{"segment_id":201,"speaker_group":67,"source_text":"They helped with constructing the genome."},{"segment_id":202,"speaker_group":67,"source_text":"They help with intuitive abilities."},{"segment_id":203,"speaker_group":67,"source_text":"The empathic and intuitive side of the human comes from the Insectoids."},{"segment_id":204,"speaker_group":67,"source_text":"The survival skills often come from the Reptoids."},{"segment_id":205,"speaker_group":67,"source_text":"And being able to, she says survive under harsh conditions, these type of things."},{"segment_id":206,"speaker_group":67,"source_text":"You need these things."},{"segment_id":207,"speaker_group":67,"source_text":"Even though they can often feel dense, you need the DNA from these type of species."},{"segment_id":208,"speaker_group":67,"source_text":"She's bringing me back to part of the question earlier that we spoke of, the Reptoids."},{"segment_id":209,"speaker_group":68,"source_text":"When did they come in?"},{"segment_id":210,"speaker_group":68,"source_text":"At what point in our history did we allow that energy to come in?"},{"segment_id":211,"speaker_group":69,"source_text":"OK."},{"segment_id":212,"speaker_group":69,"source_text":"OK, so she wants to talk about the hierarchy, because that helps understand it."},{"segment_id":213,"speaker_group":69,"source_text":"She's saying that all these beings understand hierarchy."},{"segment_id":214,"speaker_group":69,"source_text":"It's not just the Reptoid."},{"segment_id":215,"speaker_group":69,"source_text":"Even the Pleiades understand that there must be some type of hierarchical collaboration formed in order for order--"},{"segment_id":216,"speaker_group":70,"source_text":"Structure."},{"segment_id":217,"speaker_group":71,"source_text":"Yeah."},{"segment_id":218,"speaker_group":71,"source_text":"She says it's not saying that others are greater or others are lesser."},{"segment_id":219,"speaker_group":71,"source_text":"It's just the way to keep organization."},{"segment_id":220,"speaker_group":71,"source_text":"She says, now, that being said, if the higher look down upon the lower as lesser, and the lesser feel that they are lesser, that is when the domination occurs and the consciousness can shift."},{"segment_id":221,"speaker_group":71,"source_text":"But let me talk about timeline first, and then I can explain to you some of the other beings behind the agendas that-- what you would call Reptilian."},{"segment_id":222,"speaker_group":72,"source_text":"Mm-hm."},{"segment_id":223,"speaker_group":73,"source_text":"She says, let's call them the serpent species."},{"segment_id":224,"speaker_group":74,"source_text":"Yes."},{"segment_id":225,"speaker_group":74,"source_text":"OK."},{"segment_id":226,"speaker_group":75,"source_text":"But this doesn't necessarily mean that they are Reptoid in nature."},{"segment_id":227,"speaker_group":75,"source_text":"It means that they are of the serpent star system."},{"segment_id":228,"speaker_group":75,"source_text":"I'm asking her if it's like that Alpha Draconis."},{"segment_id":229,"speaker_group":76,"source_text":"Right."},{"segment_id":230,"speaker_group":77,"source_text":"She says yes, but it's also bigger."},{"segment_id":231,"speaker_group":77,"source_text":"Something that the ancients knew of."},{"segment_id":232,"speaker_group":77,"source_text":"They called it the serpent star system, basically."},{"segment_id":233,"speaker_group":77,"source_text":"And there was a serpent species because they came from that location."},{"segment_id":234,"speaker_group":77,"source_text":"I'm asking her to give me a linear time of when the consciousness transitioned."},{"segment_id":235,"speaker_group":77,"source_text":"And she's just showing me a lot of dragon stuff, and I'm not understanding."},{"segment_id":236,"speaker_group":77,"source_text":"Let's see if I can get her to give me numbers."},{"segment_id":237,"speaker_group":77,"source_text":"She's not giving me a time period of when consciousness really changed."},{"segment_id":238,"speaker_group":77,"source_text":"I feel like it might be such a slow process that it's hard to give a date."},{"segment_id":239,"speaker_group":78,"source_text":"Sure, sure."},{"segment_id":240,"speaker_group":78,"source_text":"Was the Annunaki intervention pre-dinosaur era, or after?"},{"segment_id":241,"speaker_group":79,"source_text":"I want to say pre."},{"segment_id":242,"speaker_group":80,"source_text":"She says, but it also depends on the regions."},{"segment_id":243,"speaker_group":80,"source_text":"Some regions didn't inhabit the beings-- and she's referring to the dinosaurs-- for quite some time."},{"segment_id":244,"speaker_group":80,"source_text":"And even then, more humans were able to occupy the area, or land dominated species."},{"segment_id":245,"speaker_group":81,"source_text":"Mm-hm."},{"segment_id":246,"speaker_group":81,"source_text":"So were dinosaurs more of human's natural evolution?"},{"segment_id":247,"speaker_group":81,"source_text":"Or was their genetic manipulation with the dinosaurs coming to Earth?"},{"segment_id":248,"speaker_group":82,"source_text":"OK, I'm asking her to slow down."},{"segment_id":249,"speaker_group":82,"source_text":"There was some natural evolution process with the dinosaur species, but it basically was put forth on the surface to start as a testing point to see what type of species could survive, what type of evolution would occur on its own, what type of things need to tampering in order to survive these type of things."},{"segment_id":250,"speaker_group":82,"source_text":"She says, and this is why we say that time periods are difficult, because there were areas where dinosaurs were only able to survive for a brief time, other places where they were able to survive and thrive quite freely."},{"segment_id":251,"speaker_group":82,"source_text":"And so the areas and the regions helped dictate the time period, as well as where humans were able to go."},{"segment_id":252,"speaker_group":83,"source_text":"Mm-hm."},{"segment_id":253,"speaker_group":83,"source_text":"And I assume that's the same for humans too."},{"segment_id":254,"speaker_group":83,"source_text":"Different pockets of humans, different areas, could survive longer."},{"segment_id":255,"speaker_group":84,"source_text":"She says yes."},{"segment_id":256,"speaker_group":84,"source_text":"That's very good to think that, because in different regions, your genetic genome needed certain, she says-- I might call it upgrades in order for you to survive."},{"segment_id":257,"speaker_group":84,"source_text":"In order for you to think, or to have the ability within your body to survive longer than needed."},{"segment_id":258,"speaker_group":85,"source_text":"Mm-hm."},{"segment_id":259,"speaker_group":85,"source_text":"So getting back to the Atlantean Annunaki karma, then the dinosaur karma, is it true, as our scientists are figuring out, that an asteroid created the extinction event on planet Earth, the reset for the dinosaurs?"},{"segment_id":260,"speaker_group":86,"source_text":"She says, we think that they are on the right path."},{"segment_id":261,"speaker_group":86,"source_text":"Obviously, there is a little bit more to it."},{"segment_id":262,"speaker_group":86,"source_text":"There were chemicals that were set forth to create fires and erosion-- I feel like maybe that could be earthquakes--"},{"segment_id":263,"speaker_group":87,"source_text":"OK."},{"segment_id":264,"speaker_group":88,"source_text":"--in order to offset the species."},{"segment_id":265,"speaker_group":89,"source_text":"To reset things a little bit?"},{"segment_id":266,"speaker_group":90,"source_text":"With the dinosaurs specifically is what she's showing me."},{"segment_id":267,"speaker_group":90,"source_text":"I feel like there's a couple different times when this happened, based on what she's showing me."},{"segment_id":268,"speaker_group":91,"source_text":"So maybe more than one extinction event."},{"segment_id":269,"speaker_group":92,"source_text":"Yes."},{"segment_id":270,"speaker_group":92,"source_text":"And this one doesn't seem to do with water."},{"segment_id":271,"speaker_group":92,"source_text":"It seems to do more with gases and fire."},{"segment_id":272,"speaker_group":92,"source_text":"There's a lot of burning around the regions that she's showing me, and earthquakes."},{"segment_id":273,"speaker_group":93,"source_text":"And I understand that all this is for different evolution-- for the evolution of various species, and animals, plants, humanoids, dinosaurs, et cetera."},{"segment_id":274,"speaker_group":93,"source_text":"Why does the Earth itself need to have all this stuff going on?"},{"segment_id":275,"speaker_group":93,"source_text":"What is it getting out of all this?"},{"segment_id":276,"speaker_group":94,"source_text":"She's saying that it just has to go through its own planetary cycle, just as a cell would gain expansion, or she says maybe what you would call evolution, through going through a little bit of stress."},{"segment_id":277,"speaker_group":94,"source_text":"Strain and division, these kind of things, it's just part of the way she says the universe works."},{"segment_id":278,"speaker_group":95,"source_text":"Sure."},{"segment_id":279,"speaker_group":96,"source_text":"It isn't to hurt Gaia, she says."},{"segment_id":280,"speaker_group":96,"source_text":"It's to help it transition, and to reach into higher consciousness."},{"segment_id":281,"speaker_group":96,"source_text":"Many of other planets do the same."},{"segment_id":282,"speaker_group":97,"source_text":"Mm-hm."},{"segment_id":283,"speaker_group":97,"source_text":"Just to go back to our history a little bit more, then, and the different energies and beings. These other races, this borrowed DNA that we were created from, did they-- I'm assuming they also signed up for that."},{"segment_id":284,"speaker_group":97,"source_text":"Loaning their DNA."},{"segment_id":285,"speaker_group":97,"source_text":"What was their intention?"},{"segment_id":286,"speaker_group":97,"source_text":"What were, say, the Pleiades' intention, and Reptilians, at that time?"},{"segment_id":287,"speaker_group":97,"source_text":"Or Zeta."},{"segment_id":288,"speaker_group":97,"source_text":"Do we have Zeta DNA?"},{"segment_id":289,"speaker_group":98,"source_text":"She's saying no, not the Annunaki creation."},{"segment_id":290,"speaker_group":98,"source_text":"Perhaps in a roundabout way, as Zeta DNA can be shared in a roundabout way with other species."},{"segment_id":291,"speaker_group":98,"source_text":"But you have not been transplanted with their direct DNA."},{"segment_id":292,"speaker_group":98,"source_text":"But there had been multiple experimentations on the Zetas' part prior to the Annunaki taking control."},{"segment_id":293,"speaker_group":99,"source_text":"Oh, interesting."},{"segment_id":294,"speaker_group":100,"source_text":"She says, to answer the question about the DNA exchange, they were all to be a part of the interactions, and all to share it, and have their regions accordingly to-- she says maybe what you call family."},{"segment_id":295,"speaker_group":100,"source_text":"For example, let's say that a family from the Pleiades had a region to control and dominate on the Earth's surface."},{"segment_id":296,"speaker_group":100,"source_text":"And a Reptilian would have an area."},{"segment_id":297,"speaker_group":100,"source_text":"She says the Insectoids that we speak of, they were mixed in."},{"segment_id":298,"speaker_group":100,"source_text":"There was a mixture."},{"segment_id":299,"speaker_group":100,"source_text":"They were in agreement to divide, dominate, and to be in their regions."},{"segment_id":300,"speaker_group":100,"source_text":"And this also remains still up into the galaxies as well as Earth."},{"segment_id":301,"speaker_group":100,"source_text":"It was a contract for, she says, like the souls."},{"segment_id":302,"speaker_group":100,"source_text":"They agreed upon it."},{"segment_id":303,"speaker_group":100,"source_text":"There was no good or bad."},{"segment_id":304,"speaker_group":100,"source_text":"There was just-- she says it was almost like a big family."},{"segment_id":305,"speaker_group":101,"source_text":"Mm-hm."},{"segment_id":306,"speaker_group":101,"source_text":"So to create a place, a meeting ground to mix the energy so we can get along better."},{"segment_id":307,"speaker_group":102,"source_text":"Yeah, well, what's the intent?"},{"segment_id":308,"speaker_group":102,"source_text":"The intent, she says, to create."},{"segment_id":309,"speaker_group":103,"source_text":"Just to create."},{"segment_id":310,"speaker_group":104,"source_text":"Just to be godlike, to create something."},{"segment_id":311,"speaker_group":104,"source_text":"But they needed other DNA."},{"segment_id":312,"speaker_group":104,"source_text":"They couldn't do it solely with one DNA on the surface of Earth."},{"segment_id":313,"speaker_group":104,"source_text":"It wasn't applicable."},{"segment_id":314,"speaker_group":105,"source_text":"So the Earth environment itself is pretty unique, then, in the galaxy?"},{"segment_id":315,"speaker_group":106,"source_text":"She says, in this instance, yes."},{"segment_id":316,"speaker_group":106,"source_text":"They needed multiple types of DNA."},{"segment_id":317,"speaker_group":106,"source_text":"Even mammalian."},{"segment_id":318,"speaker_group":106,"source_text":"Mammalian was used."},{"segment_id":319,"speaker_group":106,"source_text":"But it was understood that only-- she's showing me leaders."},{"segment_id":320,"speaker_group":106,"source_text":"That there would only be a certain group of leaders for this."},{"segment_id":321,"speaker_group":106,"source_text":"So they did the exchange accordingly."},{"segment_id":322,"speaker_group":106,"source_text":"She's saying that part of also the exchange was for the leaders to not inhibit certain parts of the planet if they could exchange the DNA, and they would be protected, if that makes sense, in regions."},{"segment_id":323,"speaker_group":107,"source_text":"The regions would be protected."},{"segment_id":324,"speaker_group":108,"source_text":"Yeah."},{"segment_id":325,"speaker_group":109,"source_text":"Right."},{"segment_id":326,"speaker_group":110,"source_text":"I feel like I-- she's showing me a lot of dolphins and mammalians in the waters."},{"segment_id":327,"speaker_group":110,"source_text":"They were not to dominate the waters in the way that they did the land."},{"segment_id":328,"speaker_group":110,"source_text":"And for that, they could exchange DNA."},{"segment_id":329,"speaker_group":110,"source_text":"So there were these contracts and agreements."},{"segment_id":330,"speaker_group":111,"source_text":"So that would be the Sirian energy?"},{"segment_id":331,"speaker_group":112,"source_text":"She says yes."},{"segment_id":332,"speaker_group":113,"source_text":"OK."},{"segment_id":333,"speaker_group":113,"source_text":"So where are we going with all this?"},{"segment_id":334,"speaker_group":113,"source_text":"[CHUCKLES] What's next?"},{"segment_id":335,"speaker_group":114,"source_text":"So why is this so important?"},{"segment_id":336,"speaker_group":115,"source_text":"Why is it so important that we have this galactic soup here on Earth?"},{"segment_id":337,"speaker_group":116,"source_text":"She says, well, for one case, for one thing that we really want to drive home, so to speak, in the human species consciousness is to understand there's no good and evil."},{"segment_id":338,"speaker_group":116,"source_text":"The serpent species has been termed as the evil, the benevolent, the Pleiades, and they have been working together."},{"segment_id":339,"speaker_group":116,"source_text":"She says, but what you have are individual consciousness, perhaps, or beings that individually selected to dominate in an unbeneficial way."},{"segment_id":340,"speaker_group":117,"source_text":"And they get blamed for--"},{"segment_id":341,"speaker_group":118,"source_text":"She says yes."},{"segment_id":342,"speaker_group":118,"source_text":"Basically to-- she says, we want to go back to the serpent species, because we have spoken that they are not all Reptilian."},{"segment_id":343,"speaker_group":118,"source_text":"The serpent species also has beings that have used the domination for evil purposes, quote unquote, she says, to take over consciousness."},{"segment_id":344,"speaker_group":118,"source_text":"But they don't look like reptiles."},{"segment_id":345,"speaker_group":118,"source_text":"So basically, we've pinned the reptile as the bad, the benevolent blondes as the god good."},{"segment_id":346,"speaker_group":119,"source_text":"Of course, because that's what we look like."},{"segment_id":347,"speaker_group":120,"source_text":"Yeah."},{"segment_id":348,"speaker_group":121,"source_text":"[CHUCKLING] We're good, you're bad."},{"segment_id":349,"speaker_group":121,"source_text":"Anything that looks different."},{"segment_id":350,"speaker_group":122,"source_text":"But I almost feel like they were good, so to speak."},{"segment_id":351,"speaker_group":122,"source_text":"They were trying to be creator gods."},{"segment_id":352,"speaker_group":122,"source_text":"And other species from the serpent species used that power to dominate the human consciousness, if that makes sense."},{"segment_id":353,"speaker_group":122,"source_text":"Using an archetype is only going back so far."},{"segment_id":354,"speaker_group":122,"source_text":"It sounds like there's more to the story than just archetypes."},{"segment_id":355,"speaker_group":123,"source_text":"She says yes."},{"segment_id":356,"speaker_group":123,"source_text":"Consider once again the part of your question where you brought in the dinosaurs."},{"segment_id":357,"speaker_group":123,"source_text":"They are survival, but their DNA is key in the planetary creation."},{"segment_id":358,"speaker_group":123,"source_text":"And so when you consider this, you consider that the human is a large part of this, so to hate them would be to hate yourself."},{"segment_id":359,"speaker_group":124,"source_text":"Absolutely."},{"segment_id":360,"speaker_group":125,"source_text":"She's saying, also consider what we speak of the serpent species."},{"segment_id":361,"speaker_group":125,"source_text":"And also, when you do your research, go back and find that there is serpent species, serpent race, these type of callings-- names."},{"segment_id":362,"speaker_group":125,"source_text":"She says, see if you can't tap in and see the visuals, and see that not all are actually reptiles."},{"segment_id":363,"speaker_group":125,"source_text":"Some look, she says, more mammalian."},{"segment_id":364,"speaker_group":125,"source_text":"All kinds."},{"segment_id":365,"speaker_group":125,"source_text":"All kinds, she says."},{"segment_id":366,"speaker_group":125,"source_text":"Even some bird."},{"segment_id":367,"speaker_group":126,"source_text":"Yeah."},{"segment_id":368,"speaker_group":127,"source_text":"They represent the Reptilian agenda that you now reference in today's timeline, though."},{"segment_id":369,"speaker_group":127,"source_text":"The conquering the human consciousness."},{"segment_id":370,"speaker_group":127,"source_text":"And so when you hear Reptilian, this is what you think of."},{"segment_id":371,"speaker_group":127,"source_text":"When you hear serpent, you think, oh, the Reptilian domination."},{"segment_id":372,"speaker_group":127,"source_text":"But the serpent species is actually a broader idea."},{"segment_id":373,"speaker_group":128,"source_text":"Well, we do know, in our own evolution, how birds are linked to the Reptilian energy."},{"segment_id":374,"speaker_group":128,"source_text":"The Avians are quite close in the family."},{"segment_id":375,"speaker_group":128,"source_text":"But my understanding is that the Pleiadians have a lot of that energy already as well-- the bird energy, or."},{"segment_id":376,"speaker_group":129,"source_text":"She says they do."},{"segment_id":377,"speaker_group":129,"source_text":"They do."},{"segment_id":378,"speaker_group":129,"source_text":"And remember, they work together."},{"segment_id":379,"speaker_group":129,"source_text":"They understand one another."},{"segment_id":380,"speaker_group":129,"source_text":"OK, so she's showing me some visuals of the Pleiades actually having large families."},{"segment_id":381,"speaker_group":129,"source_text":"They sort of-- I'm getting spacey because-- OK, she's trying to get through to me."},{"segment_id":382,"speaker_group":129,"source_text":"Hold on."},{"segment_id":383,"speaker_group":130,"source_text":"Mm-hm."},{"segment_id":384,"speaker_group":131,"source_text":"They were the first advocates of one male, several females, because they understood the lineage and the importance of carrying on down the bloodlines."},{"segment_id":385,"speaker_group":131,"source_text":"This came from your Orion star system, but it has turned into something negative."},{"segment_id":386,"speaker_group":131,"source_text":"But that which you call God came from this sort of idea that lineage could be carried down through the bloodlines and to--"},{"segment_id":387,"speaker_group":132,"source_text":"Can you back up and explain that what we call God?"},{"segment_id":388,"speaker_group":132,"source_text":"You mean the male figure of God?"},{"segment_id":389,"speaker_group":133,"source_text":"Yes."},{"segment_id":390,"speaker_group":134,"source_text":"OK."},{"segment_id":391,"speaker_group":134,"source_text":"Basically, she says, like, Abrahamic covenant."},{"segment_id":392,"speaker_group":135,"source_text":"OK."},{"segment_id":393,"speaker_group":135,"source_text":"That idea of God, the image of God, she's saying that she just wants humanity to understand that there are beings of Orion that have a very male dominant type of energy that have brought that to Earth."},{"segment_id":394,"speaker_group":135,"source_text":"The rulingship of the man, basically, and passing it down through the bloodlines into the males."},{"segment_id":395,"speaker_group":135,"source_text":"She says, mainly, though, because also, a man can have several children with different wives and pass his seed along to ensure that his kingdom would be maintained accordingly."},{"segment_id":396,"speaker_group":135,"source_text":"And he can pass down his lineage and his ideas that way."},{"segment_id":397,"speaker_group":135,"source_text":"But that comes from not necessarily Reptilian."},{"segment_id":398,"speaker_group":135,"source_text":"She's saying, that's an Orion energy."},{"segment_id":399,"speaker_group":135,"source_text":"She says, not saying that we live like that here."},{"segment_id":400,"speaker_group":135,"source_text":"We're just saying that that was incorporated with that idea from us, from the Orion."},{"segment_id":401,"speaker_group":136,"source_text":"It was part of our DNA."},{"segment_id":402,"speaker_group":137,"source_text":"Yeah."},{"segment_id":403,"speaker_group":138,"source_text":"That we carry that energy."},{"segment_id":404,"speaker_group":138,"source_text":"And I guess we're working through that."},{"segment_id":405,"speaker_group":138,"source_text":"And it's not serving us anymore, so we're evolving past that now, or-- some of us."},{"segment_id":406,"speaker_group":138,"source_text":"[CHUCKLES]"},{"segment_id":407,"speaker_group":139,"source_text":"She says you're moving past the rulingship."},{"segment_id":408,"speaker_group":139,"source_text":"There is still the idea behind a man being able to have children from several other wives that can also be beneficial because we are still mammalian, in a large sense, and we are working toward building more of the community based on that idea."},{"segment_id":409,"speaker_group":139,"source_text":"She's saying, but it also all goes back to your original concerns and questions with the Reptilian and the rulingship now, that the rulers and the kings and the queens, that is a Reptilian idea."},{"segment_id":410,"speaker_group":139,"source_text":"She says it's not necessarily--"},{"segment_id":411,"speaker_group":140,"source_text":"OK."},{"segment_id":412,"speaker_group":140,"source_text":"Yeah, I understand now what she's trying to convey, as far as, I had this concept of hierarchy and ruling being a Reptilian idea."},{"segment_id":413,"speaker_group":140,"source_text":"And sounds like that's-- there's some aspects of that in the Reptilian lineage, but that's not a Reptilian, so to say-- that aspect particularly isn't just from the Reptilians."},{"segment_id":414,"speaker_group":141,"source_text":"But my understanding of that Reptilian archetype as a very male, masculine energy."},{"segment_id":415,"speaker_group":141,"source_text":"And then I've also understood that the Pleiadians has been more of a feminine, a softer energy."},{"segment_id":416,"speaker_group":141,"source_text":"And the merging of the two, the Annunaki, and then us, creating, adding extra spices in there, it seems."},{"segment_id":417,"speaker_group":142,"source_text":"She says, that is true."},{"segment_id":418,"speaker_group":142,"source_text":"One thing to note, though, is that the male side in the Pleiade region is more like a mentor-- teacher."},{"segment_id":419,"speaker_group":142,"source_text":"And that can take on that feminine side, but also understands the male role."},{"segment_id":420,"speaker_group":142,"source_text":"The feminine side of the Reptilian, she says, is gaining wisdom and working that into knowledge with teaching the youth."},{"segment_id":421,"speaker_group":142,"source_text":"Those type of things."},{"segment_id":422,"speaker_group":142,"source_text":"Creating a better lifestyle for communities with technology, and that kind of business, she says."},{"segment_id":423,"speaker_group":142,"source_text":"So there is a little bit of both that is different."},{"segment_id":424,"speaker_group":142,"source_text":"But we have interpreted the male energy is dominant, and maybe perhaps controlling, because that is what the humans have perceived it to be for so long."},{"segment_id":425,"speaker_group":143,"source_text":"It's what we experienced here."},{"segment_id":426,"speaker_group":143,"source_text":"Or at least our history and what we remember so far."},{"segment_id":427,"speaker_group":143,"source_text":"So I'm assuming as we uncover our history, we can break free of some of these stereotypes of what a male is, what a female is."},{"segment_id":428,"speaker_group":144,"source_text":"She says yes."},{"segment_id":429,"speaker_group":144,"source_text":"She says, one more thing to add is the serpent species as we spoke of-- or Reptilians-- don't tend to hide the masculinity in that sense."},{"segment_id":430,"speaker_group":144,"source_text":"The Orion side, they understand that, and they allow it to occur."},{"segment_id":431,"speaker_group":144,"source_text":"But they also know how to-- she says mask it in a sense with their ability to teach."},{"segment_id":432,"speaker_group":144,"source_text":"But there still is a bit of a masculine side that they incorporate, or have incorporated into the human experience."},{"segment_id":433,"speaker_group":145,"source_text":"Again, where we're going with all this, getting back to that, it seems like humans are going to have-- maybe not the way the Annunaki had originally intended, but we still are going to have a strong presence in this galaxy."},{"segment_id":434,"speaker_group":146,"source_text":"She says yes."},{"segment_id":435,"speaker_group":146,"source_text":"That is key to, say, teaching, because you have entered into the 3D world that has benefited you greatly in understanding and learning in a subconscious way."},{"segment_id":436,"speaker_group":146,"source_text":"And now that you are fully awakening and becoming conscious, you now can become the teachers and allowing others to understand their full capacity."},{"segment_id":437,"speaker_group":146,"source_text":"So in a sense, it has been very beneficial for you to experience the world in the way that you have."},{"segment_id":438,"speaker_group":146,"source_text":"It has been-- she says, what we have called an excellent simulation of learning."},{"segment_id":439,"speaker_group":147,"source_text":"Mm."},{"segment_id":440,"speaker_group":147,"source_text":"And these other races that are part of us that are observing humanity now, and have been, I'm assuming they're learning a lot just by the observation process."},{"segment_id":441,"speaker_group":148,"source_text":"She says yes."},{"segment_id":442,"speaker_group":148,"source_text":"Yes."},{"segment_id":443,"speaker_group":148,"source_text":"They've realized a lot of their mistakes because of how we've dealt with what they've taught us."},{"segment_id":444,"speaker_group":148,"source_text":"And they have evolved because of it, because they are working to undo some of this, and expanding themselves into other areas of thinking."},{"segment_id":445,"speaker_group":148,"source_text":"She says, initially, it was done to protect the human race, the human species, the DNA that was created, these type of things, and to let you have the best life possible."},{"segment_id":446,"speaker_group":148,"source_text":"But of course, things transpired the way they did, where beings took over consciousness."},{"segment_id":447,"speaker_group":148,"source_text":"And they see both perspectives."},{"segment_id":448,"speaker_group":148,"source_text":"And that is important in expansion."},{"segment_id":449,"speaker_group":149,"source_text":"When you say beings took over consciousness, is this the integration of the downgrade into third density?"},{"segment_id":450,"speaker_group":150,"source_text":"Yes."},{"segment_id":451,"speaker_group":150,"source_text":"She says it's back into the serpent race, which is not necessarily the serpent, but beings that wanted to take over consciousness."},{"segment_id":452,"speaker_group":150,"source_text":"And then now you have lower dimensional Reptilians that-- she says, and others."},{"segment_id":453,"speaker_group":150,"source_text":"She didn't want me to limit it to that."},{"segment_id":454,"speaker_group":150,"source_text":"But others that like to maintain control over the consciousness."},{"segment_id":455,"speaker_group":151,"source_text":"And because of the energy where we're at in our evolution, that was sort of an easy gateway into that?"},{"segment_id":456,"speaker_group":152,"source_text":"She says yes."},{"segment_id":457,"speaker_group":152,"source_text":"They understood the cycle of the planet."},{"segment_id":458,"speaker_group":152,"source_text":"They understood that when the planet cycled in a particular way, that it opened a gateway-- as you spoke of-- to enter into lower consciousness."},{"segment_id":459,"speaker_group":152,"source_text":"And the Annunaki and higher beings of dimensions were forced to leave because they could not re-enter in the same way that they w-- they were not able to appear to humans like they had before, and guide them."},{"segment_id":460,"speaker_group":152,"source_text":"Everything was subconscious, she said, at that point."},{"segment_id":461,"speaker_group":153,"source_text":"So almost like getting contact now, for many of us who are having dream experiences."},{"segment_id":462,"speaker_group":153,"source_text":"When things become too dense, then that's really the only gateway in."},{"segment_id":463,"speaker_group":153,"source_text":"Where, maybe on some parts of the Earth, where the actual physical area is in a higher frequency, then those can be gateways of-- doorways in for higher dimensional beings, physically."},{"segment_id":464,"speaker_group":154,"source_text":"She says yes."},{"segment_id":465,"speaker_group":154,"source_text":"And also consider, there were several attempts before this transition, while we were making contact with you with the humans to try to pull them out of this sort of mindset that they were getting taken or putting a hold on to."},{"segment_id":466,"speaker_group":154,"source_text":"But the humans wouldn't allow it."},{"segment_id":467,"speaker_group":154,"source_text":"They still worshipped the gods that led them into avenues that were unbeneficial."},{"segment_id":468,"speaker_group":154,"source_text":"They still desired trade and money over spiritual things at this point, and we could not reach them."},{"segment_id":469,"speaker_group":154,"source_text":"She says, so we were asked to leave by the consciousness, basically."},{"segment_id":470,"speaker_group":155,"source_text":"So it was our own doing."},{"segment_id":471,"speaker_group":155,"source_text":"Wasn't an outside source."},{"segment_id":472,"speaker_group":155,"source_text":"I mean, it wasn't out--"},{"segment_id":473,"speaker_group":156,"source_text":"She says, in a sense, but you had helped to push you along."},{"segment_id":474,"speaker_group":156,"source_text":"You had the choice all along, though."},{"segment_id":475,"speaker_group":157,"source_text":"Sure."},{"segment_id":476,"speaker_group":157,"source_text":"Do we always have-- we always have that choice initially, don't we?"},{"segment_id":477,"speaker_group":158,"source_text":"She says yes, but it can be very, very difficult."},{"segment_id":478,"speaker_group":159,"source_text":"But now, it seems the choice-- that doorway has come to us again, and now-- at least the timeline I choose to be in, it seems that we are making that choice to let in our higher frequency brothers and sisters come in--"},{"segment_id":479,"speaker_group":160,"source_text":"She says yes."},{"segment_id":480,"speaker_group":161,"source_text":"--and make the shift the other direction, because we've--"},{"segment_id":481,"speaker_group":162,"source_text":"She says many of us are wanting and hoping to come back in the same way that we had that contact with you prior."},{"segment_id":482,"speaker_group":162,"source_text":"And we're hoping that you remember that some part of your consciousness remembers that you once had had contact in that similar way, and that everything was OK."},{"segment_id":483,"speaker_group":163,"source_text":"Was the last gateway for this energy, was this back in the Egyptian days?"},{"segment_id":484,"speaker_group":164,"source_text":"I feel like she's showing me Rome."},{"segment_id":485,"speaker_group":164,"source_text":"There was a gateway in Rome, and--"},{"segment_id":486,"speaker_group":165,"source_text":"In Rome."},{"segment_id":487,"speaker_group":165,"source_text":"OK."},{"segment_id":488,"speaker_group":166,"source_text":"Yeah."},{"segment_id":489,"speaker_group":166,"source_text":"I don't know what year's the are, but I feel like it's further-- so would it be Brutus, I think, is what she's saying?"},{"segment_id":490,"speaker_group":166,"source_text":"Brutus and Augustus, I think."},{"segment_id":491,"speaker_group":166,"source_text":"Which is--"},{"segment_id":492,"speaker_group":167,"source_text":"By the way, I totally failed history."},{"segment_id":493,"speaker_group":167,"source_text":"[CHUCKLING]"},{"segment_id":494,"speaker_group":168,"source_text":"It's like 100 AD."},{"segment_id":495,"speaker_group":169,"source_text":"I think I know why I too, because I was just not interested."},{"segment_id":496,"speaker_group":169,"source_text":"Now it's interesting."},{"segment_id":497,"speaker_group":170,"source_text":"I think, though, based on other channelings-- I'm just going to step aside from her for a sec-- Christ consciousness was one of the last hopes to try to bring that out of people and understand their power."},{"segment_id":498,"speaker_group":171,"source_text":"Oh, OK. I see."},{"segment_id":499,"speaker_group":171,"source_text":"Right."},{"segment_id":500,"speaker_group":172,"source_text":"And there was a lot of ET interaction at the time, and a lot of beings still coming as angelic forms."},{"segment_id":501,"speaker_group":172,"source_text":"And then shortly after that, there was the close of the gateways, like you talked about."},{"segment_id":502,"speaker_group":173,"source_text":"Right."},{"segment_id":503,"speaker_group":173,"source_text":"And then probably prior to that would have been Egyptian days, yeah."},{"segment_id":504,"speaker_group":174,"source_text":"Yeah."},{"segment_id":505,"speaker_group":175,"source_text":"And what role did the Buddha energy on the planet take?"},{"segment_id":506,"speaker_group":175,"source_text":"Because that was slightly before Christ, but after the Egyptian era."},{"segment_id":507,"speaker_group":176,"source_text":"She says to bring peace."},{"segment_id":508,"speaker_group":176,"source_text":"Peace within the self."},{"segment_id":509,"speaker_group":176,"source_text":"Connection within the self."},{"segment_id":510,"speaker_group":176,"source_text":"Also a preparation for what was to come."},{"segment_id":511,"speaker_group":176,"source_text":"To be able to match up to what not only Christ consciousness, she says, but the one last loop to understand what the human was capable of."},{"segment_id":512,"speaker_group":177,"source_text":"Mm-hm."},{"segment_id":513,"speaker_group":177,"source_text":"The one last loop."},{"segment_id":514,"speaker_group":177,"source_text":"Could you--"},{"segment_id":515,"speaker_group":178,"source_text":"She says like what we spoke of before."},{"segment_id":516,"speaker_group":178,"source_text":"Before that gateway was closing, they anticipated the close shortly after Christ's death."},{"segment_id":517,"speaker_group":179,"source_text":"So this was so-- it was like a pre-dimensional door opening to prep people to--"},{"segment_id":518,"speaker_group":180,"source_text":"Mm-hm."},{"segment_id":519,"speaker_group":180,"source_text":"It sounds like it was a time for peace, and to prep."},{"segment_id":520,"speaker_group":181,"source_text":"I see."},{"segment_id":521,"speaker_group":182,"source_text":"She says, to help turn off the program for moments of time."},{"segment_id":522,"speaker_group":183,"source_text":"Mm."},{"segment_id":523,"speaker_group":183,"source_text":"And in the Tibetan energy, there's the Buddhist influence now."},{"segment_id":524,"speaker_group":183,"source_text":"But it seems like there's more ancient stuff going on there prior to Buddha's influence."},{"segment_id":525,"speaker_group":183,"source_text":"What kind of gateway are we looking at there?"},{"segment_id":526,"speaker_group":184,"source_text":"She's just showing me a lot of visuals with African."},{"segment_id":527,"speaker_group":185,"source_text":"Oh, OK."},{"segment_id":528,"speaker_group":186,"source_text":"I don't know how that correlates."},{"segment_id":529,"speaker_group":186,"source_text":"Let me see if I can get her to just tell me."},{"segment_id":530,"speaker_group":186,"source_text":"There just seems to be a correlation with some type of tribe in Africa that branched off somehow."},{"segment_id":531,"speaker_group":186,"source_text":"I don't know."},{"segment_id":532,"speaker_group":186,"source_text":"It might be beyond my library of understanding."},{"segment_id":533,"speaker_group":187,"source_text":"Sure."},{"segment_id":534,"speaker_group":187,"source_text":"Recently, we've uncovered the big temple in Gobekli Tepe."},{"segment_id":535,"speaker_group":187,"source_text":"Turkey, I believe."},{"segment_id":536,"speaker_group":187,"source_text":"Seems to be predating the Egyptian civilization."},{"segment_id":537,"speaker_group":187,"source_text":"Where did that civilization go?"},{"segment_id":538,"speaker_group":188,"source_text":"OK."},{"segment_id":539,"speaker_group":188,"source_text":"OK, so I got a lot of Grays, actually, that she's showing me."},{"segment_id":540,"speaker_group":188,"source_text":"There are reptilian-type beings that she's also showing me connected."},{"segment_id":541,"speaker_group":188,"source_text":"Very ancient."},{"segment_id":542,"speaker_group":188,"source_text":"The beings that she's showing me, they almost look also insectoid."},{"segment_id":543,"speaker_group":188,"source_text":"Let's see if she can give me any other information on the temple."},{"segment_id":544,"speaker_group":188,"source_text":"I heard-- she said something about facilitating compound."},{"segment_id":545,"speaker_group":189,"source_text":"Pyramids sit there--"},{"segment_id":546,"speaker_group":190,"source_text":"That's what she said."},{"segment_id":547,"speaker_group":190,"source_text":"I asked her, what was it for?"},{"segment_id":548,"speaker_group":190,"source_text":"What was it?"},{"segment_id":549,"speaker_group":190,"source_text":"A facilitating compound."},{"segment_id":550,"speaker_group":190,"source_text":"I feel like they're trying to build something there."},{"segment_id":551,"speaker_group":190,"source_text":"She's showing me that these beings are-- OK, so how do I put this into words?"},{"segment_id":552,"speaker_group":190,"source_text":"They are meeting together at this temple, and they are constructing things."},{"segment_id":553,"speaker_group":190,"source_text":"Almost like a meeting place."},{"segment_id":554,"speaker_group":190,"source_text":"Very ancient."},{"segment_id":555,"speaker_group":190,"source_text":"The beings are very ancient."},{"segment_id":556,"speaker_group":190,"source_text":"You said it was pre-Egyptian?"},{"segment_id":557,"speaker_group":191,"source_text":"Mm-hm."},{"segment_id":558,"speaker_group":192,"source_text":"OK, that makes sense."},{"segment_id":559,"speaker_group":192,"source_text":"Let's see if she can give me anything else about that."},{"segment_id":560,"speaker_group":192,"source_text":"[INDISTINCT WHISPERING] So facilitating with the connection of interdimensional beings as well."},{"segment_id":561,"speaker_group":192,"source_text":"Basically designed as almost a loop to gain clearer connection for furthering construction of communities and towns."},{"segment_id":562,"speaker_group":192,"source_text":"A way of life."},{"segment_id":563,"speaker_group":192,"source_text":"Even some mining, she's saying."},{"segment_id":564,"speaker_group":192,"source_text":"It's using for mining."},{"segment_id":565,"speaker_group":192,"source_text":"OK, so she's showing me that some animals were brought for genetic alterations, genetic assistance."},{"segment_id":566,"speaker_group":192,"source_text":"She says, all kinds of things."},{"segment_id":567,"speaker_group":192,"source_text":"This temple's very old."},{"segment_id":568,"speaker_group":192,"source_text":"I asked if it was a spaceport of any kind."},{"segment_id":569,"speaker_group":192,"source_text":"She's saying no, that it was more of a place of communication type."},{"segment_id":570,"speaker_group":192,"source_text":"I don't see any spacecrafts landing."},{"segment_id":571,"speaker_group":193,"source_text":"Was the Giza pyramid area, was that more of a stargate, in a sense?"},{"segment_id":572,"speaker_group":194,"source_text":"She says yes."},{"segment_id":573,"speaker_group":194,"source_text":"That's an energy gateway."},{"segment_id":574,"speaker_group":195,"source_text":"OK."},{"segment_id":575,"speaker_group":195,"source_text":"Different species coming in, and going, and doing things."},{"segment_id":576,"speaker_group":196,"source_text":"She's saying one thing different."},{"segment_id":577,"speaker_group":196,"source_text":"The pyramids had to interact and line up a certain way."},{"segment_id":578,"speaker_group":196,"source_text":"The one that you're speaking of--"},{"segment_id":579,"speaker_group":197,"source_text":"Gobekli Tepe."},{"segment_id":580,"speaker_group":198,"source_text":"Yeah."},{"segment_id":581,"speaker_group":198,"source_text":"That didn't have to align perfectly."},{"segment_id":582,"speaker_group":198,"source_text":"It was designed to be almost a direct communication."},{"segment_id":583,"speaker_group":199,"source_text":"OK."},{"segment_id":584,"speaker_group":199,"source_text":"A communication device, but not a portal for physical beings coming and going."},{"segment_id":585,"speaker_group":200,"source_text":"She says it did have portal capabilities, but it was more of a transcription."},{"segment_id":586,"speaker_group":200,"source_text":"Transcription device."},{"segment_id":587,"speaker_group":200,"source_text":"Is transcription writing?"},{"segment_id":588,"speaker_group":201,"source_text":"Yeah."},{"segment_id":589,"speaker_group":201,"source_text":"I have transcribed."},{"segment_id":590,"speaker_group":201,"source_text":"Yeah, to describe."},{"segment_id":591,"speaker_group":202,"source_text":"So they were probably getting information, and using that."},{"segment_id":592,"speaker_group":202,"source_text":"She's just showing me visuals."},{"segment_id":593,"speaker_group":202,"source_text":"There's not much else."},{"segment_id":594,"speaker_group":202,"source_text":"There's a big light coming from it, but."},{"segment_id":595,"speaker_group":203,"source_text":"Hm."},{"segment_id":596,"speaker_group":203,"source_text":"How about the Nazca South American area?"},{"segment_id":597,"speaker_group":203,"source_text":"We recently exca-- there's been some excavations and some bodies have being found, sort of Reptilian three-fingered beings."},{"segment_id":598,"speaker_group":204,"source_text":"OK."},{"segment_id":599,"speaker_group":204,"source_text":"I'm asking if she can-- or if there's a being that can help use words."},{"segment_id":600,"speaker_group":204,"source_text":"Basically, the visuals that she was showing me were these structures aligning to be a teleportation device."},{"segment_id":601,"speaker_group":204,"source_text":"And then beings were able to come through that."},{"segment_id":602,"speaker_group":204,"source_text":"OK, so she said they were also-- I feel like she's saying they were here to help mine."},{"segment_id":603,"speaker_group":205,"source_text":"Back in the Annunaki days?"},{"segment_id":604,"speaker_group":206,"source_text":"Mm, that's not clear."},{"segment_id":605,"speaker_group":207,"source_text":"OK."},{"segment_id":606,"speaker_group":207,"source_text":"Based on what she was saying, there's something to do with teleportation and mining with those beings, as far as what I asked about the role."},{"segment_id":607,"speaker_group":207,"source_text":"Timelines, I'm not sure about."},{"segment_id":608,"speaker_group":207,"source_text":"I feel like they're earlier than-- she's showing me before the first people along the Aztec."},{"segment_id":609,"speaker_group":207,"source_text":"So there was different timelines for Aztec people, and the Mayans, prior to that."},{"segment_id":610,"speaker_group":207,"source_text":"So I don't know how that all plays in to history."},{"segment_id":611,"speaker_group":207,"source_text":"I feel like she's even showing me that it's even before the humanoid was even built."},{"segment_id":612,"speaker_group":207,"source_text":"I feel like it's before-- yeah."},{"segment_id":613,"speaker_group":208,"source_text":"Even before the Annunaki came through?"},{"segment_id":614,"speaker_group":209,"source_text":"She says no."},{"segment_id":615,"speaker_group":210,"source_text":"Oh, OK."},{"segment_id":616,"speaker_group":210,"source_text":"Just right after, to assist the teleportation devices."},{"segment_id":617,"speaker_group":211,"source_text":"They were assisting the Annunaki?"},{"segment_id":618,"speaker_group":212,"source_text":"She says yes."},{"segment_id":619,"speaker_group":212,"source_text":"They were given land rights for assistance because they had certain knowledge of teleportation that the Annunaki needed help with."},{"segment_id":620,"speaker_group":212,"source_text":"She says, or we could even just say beings on the planet, because not all of them were creating the human at that time."},{"segment_id":621,"speaker_group":212,"source_text":"There were other beings that could come, but the Annunaki established Earth as their planet for the long run, and so created the human to establish their domain."},{"segment_id":622,"speaker_group":212,"source_text":"But other beings were coming and going at that time, and this was one of them."},{"segment_id":623,"speaker_group":213,"source_text":"When did the quote unquote quarantine-- that, let's say, loose term we use for these beings to stop coming--"},{"segment_id":624,"speaker_group":214,"source_text":"So she says that there are two parts to that question."},{"segment_id":625,"speaker_group":214,"source_text":"She's saying that she's giving me the 1950s, 1960s, that there were some more rules put in place with actual visitations."},{"segment_id":626,"speaker_group":214,"source_text":"But then, going back to where we could physically see them on a day-to-day like we were talking about, that is in the Roman time period when things transitioned."},{"segment_id":627,"speaker_group":215,"source_text":"Oh, so prior to the Roman era, there was more ET--"},{"segment_id":628,"speaker_group":216,"source_text":"Yeah."},{"segment_id":629,"speaker_group":216,"source_text":"So-- >> --traffic?"},{"segment_id":630,"speaker_group":217,"source_text":"Yeah."},{"segment_id":631,"speaker_group":217,"source_text":"[CHUCKLING] So let me see if I can get her to-- about 100 to 200 years after what we know as Christ's death, that's when things transitioned where there were no more visitations from light beings in this quite the same way."},{"segment_id":632,"speaker_group":217,"source_text":"She says, but when you speak of visitations from other planets-- like we spoke of other beings just coming-- there were more stricter guidelines put in place, she says, after the 1950s into the 1960s."},{"segment_id":633,"speaker_group":218,"source_text":"Is that because we had such a flux of ET activity after the nuclear bombs?"},{"segment_id":634,"speaker_group":219,"source_text":"I'm asking her why that is and she's showing me the presidents."},{"segment_id":635,"speaker_group":219,"source_text":"She's showing me the president had some-- OK, there's also some from other countries."},{"segment_id":636,"speaker_group":219,"source_text":"She's showing me they basically-- I don't know how it all went down, but there were some rules put into place."},{"segment_id":637,"speaker_group":219,"source_text":"She's saying that Earth has been quarantined in different ways at several different times."},{"segment_id":638,"speaker_group":219,"source_text":"And because of what we spoke of prior, the light beings were not able to come visit the humans in quite the same way because it had dropped down into lower density."},{"segment_id":639,"speaker_group":219,"source_text":"And then, as you speak of other density beings that could resonate with a similar frequency on Earth and come down and make some type of contact were forbidden."},{"segment_id":640,"speaker_group":219,"source_text":"And the threat was, if they continued, more chemical use would be chosen."},{"segment_id":641,"speaker_group":220,"source_text":"So it's kind of been a trade, then, on both sides for, OK, we won't intervene if you don't intervene."},{"segment_id":642,"speaker_group":220,"source_text":"[CHUCKLES]"},{"segment_id":643,"speaker_group":221,"source_text":"Mm-hm."},{"segment_id":644,"speaker_group":222,"source_text":"Interesting."},{"segment_id":645,"speaker_group":223,"source_text":"She says it was like, don't bother us."},{"segment_id":646,"speaker_group":223,"source_text":"If you do, more chemicals will be expelled."},{"segment_id":647,"speaker_group":223,"source_text":"I'm asking her how did that happen, though."},{"segment_id":648,"speaker_group":223,"source_text":"She just said communication lines."},{"segment_id":649,"speaker_group":223,"source_text":"However they're communicating."},{"segment_id":650,"speaker_group":224,"source_text":"You mean, how did these agreements come through?"},{"segment_id":651,"speaker_group":225,"source_text":"Yeah, as far as with our governments."},{"segment_id":652,"speaker_group":225,"source_text":"How did that all happen?"},{"segment_id":653,"speaker_group":225,"source_text":"She says through communication lines."},{"segment_id":654,"speaker_group":225,"source_text":"So I would assume that might not be face to face, but however they communicate."},{"segment_id":655,"speaker_group":226,"source_text":"Sure, sure."},{"segment_id":656,"speaker_group":226,"source_text":"Now, more people are having experiences, and interactions, and dreamtime experiences."},{"segment_id":657,"speaker_group":226,"source_text":"Are we at another gateway, or was 2012 one of these gateways?"},{"segment_id":658,"speaker_group":227,"source_text":"OK, so she's nodding yes to 2012."},{"segment_id":659,"speaker_group":227,"source_text":"It was the start of the opening, she says."},{"segment_id":660,"speaker_group":227,"source_text":"The door knob turning and opening was what 2012 was."},{"segment_id":661,"speaker_group":227,"source_text":"And now we are slowly pushing that door open more and more."},{"segment_id":662,"speaker_group":227,"source_text":"And then she visually showed me the door opening with the visual of several different kinds of beings, and that's where the hope is, to open that door to a point where we can visually see them once again."},{"segment_id":663,"speaker_group":227,"source_text":"She says, and have contact and visual experiences as we once had."},{"segment_id":664,"speaker_group":227,"source_text":"Can see tell us about the hybrid children?"},{"segment_id":665,"speaker_group":227,"source_text":"She says there are several different programs of hybridization Which one which one?"},{"segment_id":666,"speaker_group":228,"source_text":"The Zetas?"},{"segment_id":667,"speaker_group":229,"source_text":"She says the Zeta star system has been incorporated or Interacted with your Earth for quite some time."},{"segment_id":668,"speaker_group":229,"source_text":"They have not been so benevolent."},{"segment_id":669,"speaker_group":229,"source_text":"But yet they have brought many benefits to the human species such as sciences and mathematical reasoning, these type of things, and they also work well with other beings that have brought this, so you can say the interaction has been beneficial to have their type of species along the Earth for a time."},{"segment_id":670,"speaker_group":229,"source_text":"What we have found is they are unable to reproduce and they are in need of DNA exchange, and so there have been interactions as such she says."},{"segment_id":671,"speaker_group":229,"source_text":"In the future the exchange will also occur where... they will give you more information on technology and how to use it in your benefit as well as how to integrate other perspectives into their consciousness, mainly more of the human perspective, emotion, happiness..."},{"segment_id":672,"speaker_group":229,"source_text":"They don't understand the joy that humans can feel, but they seek it."},{"segment_id":673,"speaker_group":229,"source_text":"And in order to incorporate it they are using the DNA in a sense to bring that energy in."},{"segment_id":674,"speaker_group":230,"source_text":"And that's the hybrid children?"},{"segment_id":675,"speaker_group":231,"source_text":"This is what the hybrid children will be like."},{"segment_id":676,"speaker_group":231,"source_text":"They she's saying they all they have done several different experimentations of where the hybrid children can procreate amongst each other as well as other species to create a broader perspective for their own species."},{"segment_id":677,"speaker_group":231,"source_text":"Initially, it wasn't so they were still trying to understand how to incorporate the DNA into their own species in order to procreate on their own."},{"segment_id":678,"speaker_group":231,"source_text":"They have established it now where they are able to match to other species if desired."},{"segment_id":679,"speaker_group":232,"source_text":"So the human DNA was sort of a facilitator to connect with other species as well?"},{"segment_id":680,"speaker_group":233,"source_text":"She says, yes big time, because we have such a variety."},{"segment_id":681,"speaker_group":233,"source_text":"Yeah."},{"segment_id":682,"speaker_group":233,"source_text":"But it always is in exchange for something."},{"segment_id":683,"speaker_group":233,"source_text":"She says we never will take unless there is a... ...she says like a universal exchange."},{"segment_id":684,"speaker_group":234,"source_text":"Sure, yeah, energy exchange."},{"segment_id":685,"speaker_group":235,"source_text":"Yeah."},{"segment_id":686,"speaker_group":236,"source_text":"Many people now claim to have interactions with their hybrid children in dream time and these things, is there... will there be a time on the planet here where we can physically interact with these children or is is this more just of energetic thing to shift the planet energy."},{"segment_id":687,"speaker_group":236,"source_text":"So and further our future, these type of interactions can actually really happen?"},{"segment_id":688,"speaker_group":237,"source_text":"She's saying right now it is done consciously such as you have a human experience and that is collected and they can understand the human emotion and help raise their young as far as physical interaction... she says yes, we do see this in the future."},{"segment_id":689,"speaker_group":237,"source_text":"This is partially why the hybridization program began in order for the understanding that it can be integrated one with another and have this type of interaction."},{"segment_id":690,"speaker_group":237,"source_text":"How the timelines pan out - that is difficult to explain... for it also depends on the human consciousness in the interaction."},{"segment_id":691,"speaker_group":237,"source_text":"What is it they perceive the quote Zetas to be like, if that can evolve then yes, integration can happen very soon."},{"segment_id":692,"speaker_group":237,"source_text":"If they can learn to trust more freely and open their hearts and minds into understanding that there is connections that can be made."},{"segment_id":693,"speaker_group":237,"source_text":"Then we see this happening more sooner than later, and the children are helping bridge that connection."},{"segment_id":694,"speaker_group":238,"source_text":"It's my understanding the Zetas were interested in the human, the individualistic- ness of the human experience, but yet they saw a lack of logic in our dualistic ego selves, having sort of two consciousnesses in one consciousness."},{"segment_id":695,"speaker_group":238,"source_text":"Can you elaborate on that a little bit?"},{"segment_id":696,"speaker_group":239,"source_text":"In order to answer this question, she says I want to explain that the Zeta consciousness has been in a state where one wasn't one without the other."},{"segment_id":697,"speaker_group":239,"source_text":"Because they understand how physics, mathematical interactions always have to have an opposite and equal reaction."},{"segment_id":698,"speaker_group":239,"source_text":"You have to have two together sort of idea."},{"segment_id":699,"speaker_group":239,"source_text":"There is no concept in the logical mind of that single perspective creating... she says it's own break offs."},{"segment_id":700,"speaker_group":239,"source_text":"It typically will always have a combating or another perspective to interact with, and so logically this does not sense to their consciousness for quite some time."},{"segment_id":701,"speaker_group":239,"source_text":"But what they are finding is that in expansion, there are aspects of themselves that they are missing that the human can help them experience, and some of that is through an individual human experience."},{"segment_id":702,"speaker_group":239,"source_text":"Understanding that the human is a break off of many."},{"segment_id":703,"speaker_group":240,"source_text":"Mm-hmm."},{"segment_id":704,"speaker_group":241,"source_text":"It can split into many and this is what they are very excited about and trying to incorporate."},{"segment_id":705,"speaker_group":241,"source_text":"If you cannot logically in a sense think that it is possible, your consciousness, even if it is of slightly higher density, it cannot evolve past that until it comes to the conclusion that it must incorporate it into itself in order to evolve, or in this case to the point where it could potentially die off if it doesn't seek elsewhere perspective."},{"segment_id":706,"speaker_group":242,"source_text":"So in other words we can learn from the Zeta experience that if we get stuck in one direction, too focused in one way, then... we won't be around very much, for very long."},{"segment_id":707,"speaker_group":243,"source_text":"Yes, she says most definitely yes, thank you,."},{"segment_id":708,"speaker_group":243,"source_text":"It is the idea of many of our species, what we would say in other star systems coming into understanding that there is a balance and so we allow, all to happen the way it is and to interact the way it can be."},{"segment_id":709,"speaker_group":243,"source_text":"Otherwise we ourselves cannot expand if we do not understand one another's perspectives."},{"segment_id":710,"speaker_group":244,"source_text":"So getting back to our history, it just sounds like the human soup of all these different beings over our history of interaction, and DNA, and energies, it's just been one big evolutionary experiment."},{"segment_id":711,"speaker_group":245,"source_text":"She likes that you say the evolutionary experiment."},{"segment_id":712,"speaker_group":245,"source_text":"Yes, because we-- or the Annunaki, the creators-- are all involved with the creators are expanding in just the same that the human consciousness is."},{"segment_id":713,"speaker_group":245,"source_text":"And that was previously misunderstood."},{"segment_id":714,"speaker_group":246,"source_text":"And I guess, ultimately, the goal of all of this, is it to integrate back into source, oneness, through all these different paths of integration?"},{"segment_id":715,"speaker_group":247,"source_text":"She says yes."},{"segment_id":716,"speaker_group":247,"source_text":"And with that, to understand that living in this third density has been beneficial for your learning, because now you can become the teachers and expand even more fully into the source energy that we are all trying to, what you might say, make sense of or understand within our hearts."},{"segment_id":717,"speaker_group":248,"source_text":"So kind of like an Alcoholics Anonymous."},{"segment_id":718,"speaker_group":248,"source_text":"It takes the former alcoholic to help teach the others about-- because they've been in their shoes, to teach them how to get out of or stop the addictions."},{"segment_id":719,"speaker_group":249,"source_text":"She says yes."},{"segment_id":720,"speaker_group":249,"source_text":"And because you see that there is a paradigm allowed here on Earth, or a sort of game shift-- let's see if I can have her better term that-- matrix-style living, you understand perhaps the mindsets that can trap you into that space."},{"segment_id":721,"speaker_group":250,"source_text":"The enslavement programs."},{"segment_id":722,"speaker_group":251,"source_text":"Yes."},{"segment_id":723,"speaker_group":251,"source_text":"She says, there are others elsewhere that have fairly similar mindsets."},{"segment_id":724,"speaker_group":251,"source_text":"Perhaps you can be their guides and teach them ways to expand past beyond what you call the matrix, or the game playing."},{"segment_id":725,"speaker_group":252,"source_text":"Right."},{"segment_id":726,"speaker_group":253,"source_text":"But how would you know if you hadn't had some of that in your perspective?"},{"segment_id":727,"speaker_group":254,"source_text":"Sure."},{"segment_id":728,"speaker_group":254,"source_text":"And is that why-- I'm sure the Pleiadians, and we know the Orions, and I'm sure the reptilians, all of these different races that we're interacting now with, at some point in their evolution have had these enslavement games."},{"segment_id":729,"speaker_group":255,"source_text":"She said, I will agree for the most part, yes."},{"segment_id":730,"speaker_group":256,"source_text":"But lastly, Antarctica."},{"segment_id":731,"speaker_group":257,"source_text":"Antarctica, OK."},{"segment_id":732,"speaker_group":258,"source_text":"Pyramids being discovered in Antarctica."},{"segment_id":733,"speaker_group":258,"source_text":"I have a feeling this is a huge piece of our history."},{"segment_id":734,"speaker_group":259,"source_text":"OK, so she's nodding yes."},{"segment_id":735,"speaker_group":259,"source_text":"And she says, this is about to be revealed."},{"segment_id":736,"speaker_group":259,"source_text":"It has been quarantined in a sense for a reason."},{"segment_id":737,"speaker_group":259,"source_text":"Notice it has no dominion over it."},{"segment_id":738,"speaker_group":259,"source_text":"It is a free-for-all peaceful state."},{"segment_id":739,"speaker_group":259,"source_text":"This has been arranged for a very special reason-- to protect what it is that can come about, you see."},{"segment_id":740,"speaker_group":259,"source_text":"We are very excited for this."},{"segment_id":741,"speaker_group":259,"source_text":"Yes, give it time, and more and more can be revealed."},{"segment_id":742,"speaker_group":260,"source_text":"And sorry, one last thing."},{"segment_id":743,"speaker_group":260,"source_text":"Our Inner Earth families, our ancient civilizations that may be with us here, but sort of in hiding."},{"segment_id":744,"speaker_group":261,"source_text":"She says this is partially why this area was quarantined, or why it has been protected."},{"segment_id":745,"speaker_group":261,"source_text":"This is a gateway to a lot of those regions."},{"segment_id":746,"speaker_group":261,"source_text":"It has been revealed to some."},{"segment_id":747,"speaker_group":261,"source_text":"Some have had physical contact."},{"segment_id":748,"speaker_group":261,"source_text":"But believe this is true, she says. valid in the sense that there can be physical contact made."},{"segment_id":749,"speaker_group":261,"source_text":"Believe in your hearts that that is true, she says."},{"segment_id":750,"speaker_group":261,"source_text":"When you believe and are open to it, you can match up to a sooner timeline to experience it in your reality."},{"segment_id":751,"speaker_group":262,"source_text":"Right."},{"segment_id":752,"speaker_group":262,"source_text":"It's all about belief that brings in that--"},{"segment_id":753,"speaker_group":263,"source_text":"And welcomeness, she says."},{"segment_id":754,"speaker_group":264,"source_text":"And welcomeness, yeah."},{"segment_id":755,"speaker_group":265,"source_text":"I do feel like they're related somehow."},{"segment_id":756,"speaker_group":266,"source_text":"Mm-hm."},{"segment_id":757,"speaker_group":266,"source_text":"Can I ask where your lineages come from?"},{"segment_id":758,"speaker_group":267,"source_text":"She says, I am from the Orion as well."},{"segment_id":759,"speaker_group":267,"source_text":"I work heavily with the humans at this time."},{"segment_id":760,"speaker_group":267,"source_text":"They are going through some great shifting, and I help as a mediator."},{"segment_id":761,"speaker_group":267,"source_text":"I help as a translator to help your human mind understand certain concepts."},{"segment_id":762,"speaker_group":267,"source_text":"Forgive me, for I am trying to learn how to communicate in my best way to the human mind, for I see things as the larger picture, and you see things as a small scope, and I'm trying to shove the larger picture into that small scope in a way that you can understand, and also see the big picture."},{"segment_id":763,"speaker_group":268,"source_text":"I think you're doing a great job."},{"segment_id":764,"speaker_group":268,"source_text":"Thank you very much."},{"segment_id":765,"speaker_group":268,"source_text":"[CHUCKLES] I'm definitely getting it."},{"segment_id":766,"speaker_group":268,"source_text":"And I'm sure the people watching here will better understand this reality from sharing your perspectives."},{"segment_id":767,"speaker_group":269,"source_text":"She says, thank you so much, and know that you can come at any time and call upon the Council of Light of the Highest Good to help your individual souls evolve in just the same as we are trying to help collective."},{"segment_id":768,"speaker_group":269,"source_text":"We do hear what you might call a prayer, or an intent of action, a seeking for your own soul."},{"segment_id":769,"speaker_group":269,"source_text":"Let us guide you into the path that can help you and to put you into a life that is more fulfilled. Only if you set the intent to let the doors open, and you get to select the door."},{"segment_id":770,"speaker_group":269,"source_text":"It is not us to tell you which way to choose, but we can give you different ideas and avenues for you to choose."},{"segment_id":771,"speaker_group":269,"source_text":"She says, this is what we are very excited for you, Reuben, because this is what essentially will be happening for you in this next year."},{"segment_id":772,"speaker_group":269,"source_text":"You will have many doors, but you get to choose which path you will take."},{"segment_id":773,"speaker_group":269,"source_text":"Some of them, she says, could be lighter than others."},{"segment_id":774,"speaker_group":269,"source_text":"Know this."},{"segment_id":775,"speaker_group":269,"source_text":"And that is when perhaps the intent would be of my highest good, we can guide you to that path."},{"segment_id":776,"speaker_group":270,"source_text":"Well I hope we can continue these conversation in the future, and I appreciate all the sharing, and knowledge, and the in-depthness of our history."},{"segment_id":777,"speaker_group":270,"source_text":"It sounds like we're just on the tip of the iceberg."},{"segment_id":778,"speaker_group":271,"source_text":"Yeah."},{"segment_id":779,"speaker_group":271,"source_text":"She actually-- when you were talking, she picked up, like visually a grain of sand, and said, we have just touched on a small bit of basically a large part of the beach."},{"segment_id":780,"speaker_group":271,"source_text":"But she says, we have outlined the most important parts."},{"segment_id":781,"speaker_group":271,"source_text":"The details can come later as long as you understand the bigger picture-- As long as you can understand the bigger picture behind humanity and origins, and how it all plays out into where you're going in the future."},{"segment_id":782,"speaker_group":272,"source_text":"Yeah, I was actually surprised that she came through."},{"segment_id":783,"speaker_group":272,"source_text":"I was a little bit hoping for the reptile, but didn't go in that route."},{"segment_id":784,"speaker_group":273,"source_text":"He wasn't necessary in this conversation."},{"segment_id":785,"speaker_group":274,"source_text":"[CHUCKLES] He was not in the conversation."}]